[Killed] StringLiteral
src/messaging/edit.js:14:58
 module.exports = function (Messaging) {
     Messaging.editMessage = async (uid, mid, roomId, content) => {
         await Messaging.checkContent(content);
-        const raw = await Messaging.getMessageField(mid, 'content');
+        const raw = await Messaging.getMessageField(mid, "");
         if (raw === content) {
             return;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/edit.js:15:30
     Messaging.editMessage = async (uid, mid, roomId, content) => {
         await Messaging.checkContent(content);
         const raw = await Messaging.getMessageField(mid, 'content');
-        if (raw === content) {
-            return;
-        }
+        if (raw === content) {}
 
         const payload = await plugins.hooks.fire('filter:messaging.edit', {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/edit.js:15:13
     Messaging.editMessage = async (uid, mid, roomId, content) => {
         await Messaging.checkContent(content);
         const raw = await Messaging.getMessageField(mid, 'content');
-        if (raw === content) {
+        if (raw !== content) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/messaging/edit.js:19:75
             return;
         }
 
-        const payload = await plugins.hooks.fire('filter:messaging.edit', {
-            content: content,
-            edited: Date.now(),
-        });
+        const payload = await plugins.hooks.fire('filter:messaging.edit', {});
 
         if (!String(payload.content).trim()) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/edit.js:24:46
             edited: Date.now(),
         });
 
-        if (!String(payload.content).trim()) {
-            throw new Error('[[error:invalid-chat-message]]');
-        }
+        if (!String(payload.content).trim()) {}
         await Messaging.setMessageFields(mid, payload);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:24:13
             edited: Date.now(),
         });
 
-        if (!String(payload.content).trim()) {
+        if (true) {
             throw new Error('[[error:invalid-chat-message]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/edit.js:35:31
             Messaging.getMessagesData([mid], uid, roomId, true),
         ]);
 
-        uids.forEach((uid) => {
-            sockets.in(`uid_${uid}`).emit('event:chats.edit', {
-                messages: messages,
-            });
-        });
+        uids.forEach((uid) => {});
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/edit.js:36:43
         ]);
 
         uids.forEach((uid) => {
-            sockets.in(`uid_${uid}`).emit('event:chats.edit', {
+            sockets.in(`uid_${uid}`).emit("", {
                 messages: messages,
             });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/edit.js:36:24
         ]);
 
         uids.forEach((uid) => {
-            sockets.in(`uid_${uid}`).emit('event:chats.edit', {
+            sockets.in(``).emit('event:chats.edit', {
                 messages: messages,
             });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/edit.js:43:30
     };
 
     const canEditDelete = async (messageId, uid, type) => {
-        let durationConfig = '';
+        let durationConfig = "Stryker was here!";
         if (type === 'edit') {
             durationConfig = 'chatEditDuration';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] EqualityOperator
src/messaging/edit.js:44:13
 
     const canEditDelete = async (messageId, uid, type) => {
         let durationConfig = '';
-        if (type === 'edit') {
+        if (type !== 'edit') {
             durationConfig = 'chatEditDuration';
         } else if (type === 'delete') {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:44:13
 
     const canEditDelete = async (messageId, uid, type) => {
         let durationConfig = '';
-        if (type === 'edit') {
+        if (false) {
             durationConfig = 'chatEditDuration';
         } else if (type === 'delete') {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:46:20
         let durationConfig = '';
         if (type === 'edit') {
             durationConfig = 'chatEditDuration';
-        } else if (type === 'delete') {
+        } else if (true) {
             durationConfig = 'chatDeleteDuration';
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:46:20
         let durationConfig = '';
         if (type === 'edit') {
             durationConfig = 'chatEditDuration';
-        } else if (type === 'delete') {
+        } else if (false) {
             durationConfig = 'chatDeleteDuration';
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:51:13
         }
 
         const exists = await Messaging.messageExists(messageId);
-        if (!exists) {
+        if (true) {
             throw new Error('[[error:invalid-mid]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/edit.js:51:13
         }
 
         const exists = await Messaging.messageExists(messageId);
-        if (!exists) {
+        if (exists) {
             throw new Error('[[error:invalid-mid]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/edit.js:52:29
 
         const exists = await Messaging.messageExists(messageId);
         if (!exists) {
-            throw new Error('[[error:invalid-mid]]');
+            throw new Error("");
         }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:57:13
 
         const isAdminOrGlobalMod = await user.isAdminOrGlobalMod(uid);
 
-        if (meta.config.disableChat) {
+        if (false) {
             throw new Error('[[error:chat-disabled]]');
         } else if (!isAdminOrGlobalMod && meta.config.disableChatMessageEditing) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/edit.js:57:13
 
         const isAdminOrGlobalMod = await user.isAdminOrGlobalMod(uid);
 
-        if (meta.config.disableChat) {
+        if (true) {
             throw new Error('[[error:chat-disabled]]');
         } else if (!isAdminOrGlobalMod && meta.config.disableChatMessageEditing) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/edit.js:59:20
 
         if (meta.config.disableChat) {
             throw new Error('[[error:chat-disabled]]');
-        } else if (!isAdminOrGlobalMod && meta.config.disableChatMessageEditing) {
+        } else if (!isAdminOrGlobalMod || meta.config.disableChatMessageEditing) {
             throw new Error('[[error:chat-message-editing-disabled]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:59:20
 
         if (meta.config.disableChat) {
             throw new Error('[[error:chat-disabled]]');
-        } else if (!isAdminOrGlobalMod && meta.config.disableChatMessageEditing) {
+        } else if (false) {
             throw new Error('[[error:chat-message-editing-disabled]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/edit.js:60:29
         if (meta.config.disableChat) {
             throw new Error('[[error:chat-disabled]]');
         } else if (!isAdminOrGlobalMod && meta.config.disableChatMessageEditing) {
-            throw new Error('[[error:chat-message-editing-disabled]]');
+            throw new Error("");
         }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/edit.js:63:56
             throw new Error('[[error:chat-message-editing-disabled]]');
         }
 
-        const userData = await user.getUserFields(uid, ['banned']);
+        const userData = await user.getUserFields(uid, []);
         if (userData.banned) {
             throw new Error('[[error:user-banned]]');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:64:13
         }
 
         const userData = await user.getUserFields(uid, ['banned']);
-        if (userData.banned) {
+        if (false) {
             throw new Error('[[error:user-banned]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:64:13
         }
 
         const userData = await user.getUserFields(uid, ['banned']);
-        if (userData.banned) {
+        if (true) {
             throw new Error('[[error:user-banned]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:69:13
         }
 
         const canChat = await privileges.global.can('chat', uid);
-        if (!canChat) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/edit.js:69:23
         }
 
         const canChat = await privileges.global.can('chat', uid);
-        if (!canChat) {
-            throw new Error('[[error:no-privileges]]');
-        }
+        if (!canChat) {}
 
         const messageData = await Messaging.getMessageFields(messageId, ['fromuid', 'timestamp', 'system']);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/edit.js:70:29
 
         const canChat = await privileges.global.can('chat', uid);
         if (!canChat) {
-            throw new Error('[[error:no-privileges]]');
+            throw new Error("");
         }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/edit.js:73:98
             throw new Error('[[error:no-privileges]]');
         }
 
-        const messageData = await Messaging.getMessageFields(messageId, ['fromuid', 'timestamp', 'system']);
+        const messageData = await Messaging.getMessageFields(messageId, ['fromuid', 'timestamp', ""]);
         if (isAdminOrGlobalMod && !messageData.system) {
             return;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/edit.js:74:13
         }
 
         const messageData = await Messaging.getMessageFields(messageId, ['fromuid', 'timestamp', 'system']);
-        if (isAdminOrGlobalMod && !messageData.system) {
+        if (true) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:74:13
         }
 
         const messageData = await Messaging.getMessageFields(messageId, ['fromuid', 'timestamp', 'system']);
-        if (isAdminOrGlobalMod && !messageData.system) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/messaging/edit.js:79:72
         }
 
         const chatConfigDuration = meta.config[durationConfig];
-        if (chatConfigDuration && Date.now() - messageData.timestamp > chatConfigDuration * 1000) {
+        if (chatConfigDuration && Date.now() - messageData.timestamp > chatConfigDuration / 1000) {
             throw new Error(`[[error:chat-${type}-duration-expired, ${meta.config[durationConfig]}]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/edit.js:79:35
         }
 
         const chatConfigDuration = meta.config[durationConfig];
-        if (chatConfigDuration && Date.now() - messageData.timestamp > chatConfigDuration * 1000) {
+        if (chatConfigDuration && Date.now() - messageData.timestamp <= chatConfigDuration * 1000) {
             throw new Error(`[[error:chat-${type}-duration-expired, ${meta.config[durationConfig]}]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:83:13
             throw new Error(`[[error:chat-${type}-duration-expired, ${meta.config[durationConfig]}]]`);
         }
 
-        if (messageData.fromuid === parseInt(uid, 10) && !messageData.system) {
+        if (true && !messageData.system) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/edit.js:83:13
             throw new Error(`[[error:chat-${type}-duration-expired, ${meta.config[durationConfig]}]]`);
         }
 
-        if (messageData.fromuid === parseInt(uid, 10) && !messageData.system) {
+        if (true) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/edit.js:90:25
         throw new Error(`[[error:cant-${type}-chat-message]]`);
     };
 
-    Messaging.canEdit = async (messageId, uid) => await canEditDelete(messageId, uid, 'edit');
+    Messaging.canEdit = () => undefined;
     Messaging.canDelete = async (messageId, uid) => await canEditDelete(messageId, uid, 'delete');
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/edit.js:90:87
         throw new Error(`[[error:cant-${type}-chat-message]]`);
     };
 
-    Messaging.canEdit = async (messageId, uid) => await canEditDelete(messageId, uid, 'edit');
+    Messaging.canEdit = async (messageId, uid) => await canEditDelete(messageId, uid, "");
     Messaging.canDelete = async (messageId, uid) => await canEditDelete(messageId, uid, 'delete');
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/edit.js:91:27
     };
 
     Messaging.canEdit = async (messageId, uid) => await canEditDelete(messageId, uid, 'edit');
-    Messaging.canDelete = async (messageId, uid) => await canEditDelete(messageId, uid, 'delete');
+    Messaging.canDelete = () => undefined;
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/edit.js:91:89
     };
 
     Messaging.canEdit = async (messageId, uid) => await canEditDelete(messageId, uid, 'edit');
-    Messaging.canDelete = async (messageId, uid) => await canEditDelete(messageId, uid, 'delete');
+    Messaging.canDelete = async (messageId, uid) => await canEditDelete(messageId, uid, "");
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
