[Killed] BlockStatement
src/messaging/create.js:9:45
 const user = require('../user');
 
 module.exports = function (Messaging) {
-    Messaging.sendMessage = async (data) => {
-        await Messaging.checkContent(data.content);
-        const inRoom = await Messaging.isUserInRoom(data.uid, data.roomId);
-        if (!inRoom) {
-            throw new Error('[[error:not-allowed]]');
-        }
-
-        return await Messaging.addMessage(data);
-    };
+    Messaging.sendMessage = async (data) => {};
 
     Messaging.checkContent = async (content) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:12:13
     Messaging.sendMessage = async (data) => {
         await Messaging.checkContent(data.content);
         const inRoom = await Messaging.isUserInRoom(data.uid, data.roomId);
-        if (!inRoom) {
+        if (false) {
             throw new Error('[[error:not-allowed]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/create.js:12:13
     Messaging.sendMessage = async (data) => {
         await Messaging.checkContent(data.content);
         const inRoom = await Messaging.isUserInRoom(data.uid, data.roomId);
-        if (!inRoom) {
+        if (true) {
             throw new Error('[[error:not-allowed]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/create.js:19:49
         return await Messaging.addMessage(data);
     };
 
-    Messaging.checkContent = async (content) => {
-        if (!content) {
-            throw new Error('[[error:invalid-chat-message]]');
-        }
-
-        const maximumChatMessageLength = meta.config.maximumChatMessageLength || 1000;
-        content = String(content).trim();
-        let { length } = content;
-        ({ content, length } = await plugins.hooks.fire('filter:messaging.checkContent', { content, length }));
-        if (!content) {
-            throw new Error('[[error:invalid-chat-message]]');
-        }
-        if (length > maximumChatMessageLength) {
-            throw new Error(`[[error:chat-message-too-long, ${maximumChatMessageLength}]]`);
-        }
-    };
+    Messaging.checkContent = async (content) => {};
 
     Messaging.addMessage = async (data) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BooleanLiteral
src/messaging/create.js:20:13
     };
 
     Messaging.checkContent = async (content) => {
-        if (!content) {
+        if (content) {
             throw new Error('[[error:invalid-chat-message]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/create.js:20:13
     };
 
     Messaging.checkContent = async (content) => {
-        if (!content) {
+        if (true) {
             throw new Error('[[error:invalid-chat-message]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/create.js:24:42
             throw new Error('[[error:invalid-chat-message]]');
         }
 
-        const maximumChatMessageLength = meta.config.maximumChatMessageLength || 1000;
+        const maximumChatMessageLength = false;
         content = String(content).trim();
         let { length } = content;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:24:42
             throw new Error('[[error:invalid-chat-message]]');
         }
 
-        const maximumChatMessageLength = meta.config.maximumChatMessageLength || 1000;
+        const maximumChatMessageLength = true;
         content = String(content).trim();
         let { length } = content;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] MethodExpression
src/messaging/create.js:25:19
         }
 
         const maximumChatMessageLength = meta.config.maximumChatMessageLength || 1000;
-        content = String(content).trim();
+        content = String(content);
         let { length } = content;
         ({ content, length } = await plugins.hooks.fire('filter:messaging.checkContent', { content, length }));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/create.js:28:13
         content = String(content).trim();
         let { length } = content;
         ({ content, length } = await plugins.hooks.fire('filter:messaging.checkContent', { content, length }));
-        if (!content) {
+        if (content) {
             throw new Error('[[error:invalid-chat-message]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:28:13
         content = String(content).trim();
         let { length } = content;
         ({ content, length } = await plugins.hooks.fire('filter:messaging.checkContent', { content, length }));
-        if (!content) {
+        if (false) {
             throw new Error('[[error:invalid-chat-message]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/create.js:29:29
         let { length } = content;
         ({ content, length } = await plugins.hooks.fire('filter:messaging.checkContent', { content, length }));
         if (!content) {
-            throw new Error('[[error:invalid-chat-message]]');
+            throw new Error("");
         }
         if (length > maximumChatMessageLength) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:31:13
         if (!content) {
             throw new Error('[[error:invalid-chat-message]]');
         }
-        if (length > maximumChatMessageLength) {
+        if (true) {
             throw new Error(`[[error:chat-message-too-long, ${maximumChatMessageLength}]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/create.js:31:13
         if (!content) {
             throw new Error('[[error:invalid-chat-message]]');
         }
-        if (length > maximumChatMessageLength) {
+        if (length <= maximumChatMessageLength) {
             throw new Error(`[[error:chat-message-too-long, ${maximumChatMessageLength}]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/create.js:32:29
             throw new Error('[[error:invalid-chat-message]]');
         }
         if (length > maximumChatMessageLength) {
-            throw new Error(`[[error:chat-message-too-long, ${maximumChatMessageLength}]]`);
+            throw new Error(``);
         }
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/create.js:37:46
     };
 
     Messaging.addMessage = async (data) => {
-        const mid = await db.incrObjectField('global', 'nextMid');
+        const mid = await db.incrObjectField("", 'nextMid');
         const timestamp = data.timestamp || Date.now();
         let message = {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:38:27
 
     Messaging.addMessage = async (data) => {
         const mid = await db.incrObjectField('global', 'nextMid');
-        const timestamp = data.timestamp || Date.now();
+        const timestamp = false;
         let message = {
             content: String(data.content),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/create.js:38:27
 
     Messaging.addMessage = async (data) => {
         const mid = await db.incrObjectField('global', 'nextMid');
-        const timestamp = data.timestamp || Date.now();
+        const timestamp = data.timestamp && Date.now();
         let message = {
             content: String(data.content),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:45:21
             fromuid: data.uid,
             roomId: data.roomId,
             deleted: 0,
-            system: data.system || 0,
+            system: false,
         };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/create.js:45:21
             fromuid: data.uid,
             roomId: data.roomId,
             deleted: 0,
-            system: data.system || 0,
+            system: true,
         };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:48:13
             system: data.system || 0,
         };
 
-        if (data.ip) {
+        if (true) {
             message.ip = data.ip;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/create.js:48:22
             system: data.system || 0,
         };
 
-        if (data.ip) {
-            message.ip = data.ip;
-        }
+        if (data.ip) {}
 
         message = await plugins.hooks.fire('filter:messaging.save', message);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] UnaryOperator
src/messaging/create.js:55:83
         message = await plugins.hooks.fire('filter:messaging.save', message);
         await db.setObject(`message:${mid}`, message);
         const isNewSet = await Messaging.isNewSet(data.uid, data.roomId, timestamp);
-        let uids = await db.getSortedSetRange(`chat:room:${data.roomId}:uids`, 0, -1);
+        let uids = await db.getSortedSetRange(`chat:room:${data.roomId}:uids`, 0, +1);
         uids = await user.blocks.filterUids(data.uid, uids);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/create.js:58:27
         let uids = await db.getSortedSetRange(`chat:room:${data.roomId}:uids`, 0, -1);
         uids = await user.blocks.filterUids(data.uid, uids);
 
-        await Promise.all([
-            Messaging.addRoomToUsers(data.roomId, uids, timestamp),
-            Messaging.addMessageToUsers(data.roomId, uids, mid, timestamp),
-            Messaging.markUnread(uids.filter(uid => uid !== String(data.uid)), data.roomId),
-        ]);
+        await Promise.all([]);
 
         const messages = await Messaging.getMessagesData([mid], data.uid, data.roomId, true);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/create.js:61:53
         await Promise.all([
             Messaging.addRoomToUsers(data.roomId, uids, timestamp),
             Messaging.addMessageToUsers(data.roomId, uids, mid, timestamp),
-            Messaging.markUnread(uids.filter(uid => uid !== String(data.uid)), data.roomId),
+            Messaging.markUnread(uids.filter(uid => false), data.roomId),
         ]);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] MethodExpression
src/messaging/create.js:61:34
         await Promise.all([
             Messaging.addRoomToUsers(data.roomId, uids, timestamp),
             Messaging.addMessageToUsers(data.roomId, uids, mid, timestamp),
-            Messaging.markUnread(uids.filter(uid => uid !== String(data.uid)), data.roomId),
+            Messaging.markUnread(uids, data.roomId),
         ]);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/create.js:64:88
             Messaging.markUnread(uids.filter(uid => uid !== String(data.uid)), data.roomId),
         ]);
 
-        const messages = await Messaging.getMessagesData([mid], data.uid, data.roomId, true);
+        const messages = await Messaging.getMessagesData([mid], data.uid, data.roomId, false);
         if (!messages || !messages[0]) {
             return null;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/create.js:64:58
             Messaging.markUnread(uids.filter(uid => uid !== String(data.uid)), data.roomId),
         ]);
 
-        const messages = await Messaging.getMessagesData([mid], data.uid, data.roomId, true);
+        const messages = await Messaging.getMessagesData([], data.uid, data.roomId, true);
         if (!messages || !messages[0]) {
             return null;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/create.js:65:26
         ]);
 
         const messages = await Messaging.getMessagesData([mid], data.uid, data.roomId, true);
-        if (!messages || !messages[0]) {
+        if (!messages || messages[0]) {
             return null;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/create.js:65:40
         ]);
 
         const messages = await Messaging.getMessagesData([mid], data.uid, data.roomId, true);
-        if (!messages || !messages[0]) {
-            return null;
-        }
+        if (!messages || !messages[0]) {}
 
         messages[0].newSet = isNewSet;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/create.js:72:28
         messages[0].newSet = isNewSet;
         messages[0].mid = mid;
         messages[0].roomId = data.roomId;
-        plugins.hooks.fire('action:messaging.save', { message: messages[0], data: data });
+        plugins.hooks.fire("", { message: messages[0], data: data });
         return messages[0];
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/messaging/create.js:72:53
         messages[0].newSet = isNewSet;
         messages[0].mid = mid;
         messages[0].roomId = data.roomId;
-        plugins.hooks.fire('action:messaging.save', { message: messages[0], data: data });
+        plugins.hooks.fire('action:messaging.save', {});
         return messages[0];
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/create.js:76:66
         return messages[0];
     };
 
-    Messaging.addSystemMessage = async (content, uid, roomId) => {
-        const message = await Messaging.addMessage({
-            content: content,
-            uid: uid,
-            roomId: roomId,
-            system: 1,
-        });
-        Messaging.notifyUsersInRoom(uid, roomId, message);
-    };
+    Messaging.addSystemMessage = async (content, uid, roomId) => {};
 
     Messaging.addRoomToUsers = async (roomId, uids, timestamp) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/create.js:86:67
         Messaging.notifyUsersInRoom(uid, roomId, message);
     };
 
-    Messaging.addRoomToUsers = async (roomId, uids, timestamp) => {
-        if (!uids.length) {
-            return;
-        }
-
-        const keys = uids.map(uid => `uid:${uid}:chat:rooms`);
-        await db.sortedSetsAdd(keys, timestamp, roomId);
-    };
+    Messaging.addRoomToUsers = async (roomId, uids, timestamp) => {};
 
     Messaging.addMessageToUsers = async (roomId, uids, mid, timestamp) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/create.js:87:13
     };
 
     Messaging.addRoomToUsers = async (roomId, uids, timestamp) => {
-        if (!uids.length) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/create.js:87:27
     };
 
     Messaging.addRoomToUsers = async (roomId, uids, timestamp) => {
-        if (!uids.length) {
-            return;
-        }
+        if (!uids.length) {}
 
         const keys = uids.map(uid => `uid:${uid}:chat:rooms`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/create.js:91:31
             return;
         }
 
-        const keys = uids.map(uid => `uid:${uid}:chat:rooms`);
+        const keys = uids.map(() => undefined);
         await db.sortedSetsAdd(keys, timestamp, roomId);
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/create.js:95:75
         await db.sortedSetsAdd(keys, timestamp, roomId);
     };
 
-    Messaging.addMessageToUsers = async (roomId, uids, mid, timestamp) => {
-        if (!uids.length) {
-            return;
-        }
-        const keys = uids.map(uid => `uid:${uid}:chat:room:${roomId}:mids`);
-        await db.sortedSetsAdd(keys, timestamp, mid);
-    };
+    Messaging.addMessageToUsers = async (roomId, uids, mid, timestamp) => {};
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/create.js:96:13
     };
 
     Messaging.addMessageToUsers = async (roomId, uids, mid, timestamp) => {
-        if (!uids.length) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/create.js:96:13
     };
 
     Messaging.addMessageToUsers = async (roomId, uids, mid, timestamp) => {
-        if (!uids.length) {
+        if (true) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/create.js:99:31
         if (!uids.length) {
             return;
         }
-        const keys = uids.map(uid => `uid:${uid}:chat:room:${roomId}:mids`);
+        const keys = uids.map(() => undefined);
         await db.sortedSetsAdd(keys, timestamp, mid);
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
