[Killed] StringLiteral
src/messaging/data.js:10:75
 const utils = require('../utils');
 const plugins = require('../plugins');
 
-const intFields = ['timestamp', 'edited', 'fromuid', 'roomId', 'deleted', 'system'];
+const intFields = ['timestamp', 'edited', 'fromuid', 'roomId', 'deleted', ""];
 
 module.exports = function (Messaging) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/data.js:10:19
 const utils = require('../utils');
 const plugins = require('../plugins');
 
-const intFields = ['timestamp', 'edited', 'fromuid', 'roomId', 'deleted', 'system'];
+const intFields = [];
 
 module.exports = function (Messaging) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArithmeticOperator
src/messaging/data.js:13:34
 const intFields = ['timestamp', 'edited', 'fromuid', 'roomId', 'deleted', 'system'];
 
 module.exports = function (Messaging) {
-    Messaging.newMessageCutoff = 1000 * 60 * 3;
+    Messaging.newMessageCutoff = 1000 / 60 * 3;
 
     Messaging.getMessagesFields = async (mids, fields) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/messaging/data.js:13:34
 const intFields = ['timestamp', 'edited', 'fromuid', 'roomId', 'deleted', 'system'];
 
 module.exports = function (Messaging) {
-    Messaging.newMessageCutoff = 1000 * 60 * 3;
+    Messaging.newMessageCutoff = 1000 * 60 / 3;
 
     Messaging.getMessagesFields = async (mids, fields) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:15:59
 module.exports = function (Messaging) {
     Messaging.newMessageCutoff = 1000 * 60 * 3;
 
-    Messaging.getMessagesFields = async (mids, fields) => {
-        if (!Array.isArray(mids) || !mids.length) {
-            return [];
-        }
-
-        const keys = mids.map(mid => `message:${mid}`);
-        const messages = await db.getObjects(keys, fields);
-
-        return await Promise.all(messages.map(
-            async (message, idx) => modifyMessage(message, fields, parseInt(mids[idx], 10))
-        ));
-    };
+    Messaging.getMessagesFields = async (mids, fields) => {};
 
     Messaging.getMessageField = async (mid, field) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/data.js:16:13
     Messaging.newMessageCutoff = 1000 * 60 * 3;
 
     Messaging.getMessagesFields = async (mids, fields) => {
-        if (!Array.isArray(mids) || !mids.length) {
+        if (!Array.isArray(mids) && !mids.length) {
             return [];
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:16:51
     Messaging.newMessageCutoff = 1000 * 60 * 3;
 
     Messaging.getMessagesFields = async (mids, fields) => {
-        if (!Array.isArray(mids) || !mids.length) {
-            return [];
-        }
+        if (!Array.isArray(mids) || !mids.length) {}
 
         const keys = mids.map(mid => `message:${mid}`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrowFunction
src/messaging/data.js:20:31
             return [];
         }
 
-        const keys = mids.map(mid => `message:${mid}`);
+        const keys = mids.map(() => undefined);
         const messages = await db.getObjects(keys, fields);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/data.js:24:13
         const messages = await db.getObjects(keys, fields);
 
         return await Promise.all(messages.map(
-            async (message, idx) => modifyMessage(message, fields, parseInt(mids[idx], 10))
+            () => undefined
         ));
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:28:55
         ));
     };
 
-    Messaging.getMessageField = async (mid, field) => {
-        const fields = await Messaging.getMessageFields(mid, [field]);
-        return fields ? fields[field] : null;
-    };
+    Messaging.getMessageField = async (mid, field) => {};
 
     Messaging.getMessageFields = async (mid, fields) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/data.js:29:62
     };
 
     Messaging.getMessageField = async (mid, field) => {
-        const fields = await Messaging.getMessageFields(mid, [field]);
+        const fields = await Messaging.getMessageFields(mid, []);
         return fields ? fields[field] : null;
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:33:57
         return fields ? fields[field] : null;
     };
 
-    Messaging.getMessageFields = async (mid, fields) => {
-        const messages = await Messaging.getMessagesFields([mid], fields);
-        return messages ? messages[0] : null;
-    };
+    Messaging.getMessageFields = async (mid, fields) => {};
 
     Messaging.setMessageField = async (mid, field, content) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/data.js:38:64
         return messages ? messages[0] : null;
     };
 
-    Messaging.setMessageField = async (mid, field, content) => {
-        await db.setObjectField(`message:${mid}`, field, content);
-    };
+    Messaging.setMessageField = async (mid, field, content) => {};
 
     Messaging.setMessageFields = async (mid, data) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:42:55
         await db.setObjectField(`message:${mid}`, field, content);
     };
 
-    Messaging.setMessageFields = async (mid, data) => {
-        await db.setObject(`message:${mid}`, data);
-    };
+    Messaging.setMessageFields = async (mid, data) => {};
 
     Messaging.getMessagesData = async (mids, uid, roomId, isNew) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/data.js:47:64
     };
 
     Messaging.getMessagesData = async (mids, uid, roomId, isNew) => {
-        let messages = await Messaging.getMessagesFields(mids, []);
+        let messages = await Messaging.getMessagesFields(mids, ["Stryker was here"]);
         messages = await user.blocks.filter(uid, 'fromuid', messages);
         messages = messages
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] MethodExpression
src/messaging/data.js:48:26
 
     Messaging.getMessagesData = async (mids, uid, roomId, isNew) => {
         let messages = await Messaging.getMessagesFields(mids, []);
-        messages = await user.blocks.filter(uid, 'fromuid', messages);
+        messages = await user.blocks;
         messages = messages
             .map((msg, idx) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] MethodExpression
src/messaging/data.js:49:20
     Messaging.getMessagesData = async (mids, uid, roomId, isNew) => {
         let messages = await Messaging.getMessagesFields(mids, []);
         messages = await user.blocks.filter(uid, 'fromuid', messages);
-        messages = messages
-            .map((msg, idx) => {
-                if (msg) {
-                    msg.messageId = parseInt(mids[idx], 10);
-                    msg.ip = undefined;
-                }
-                return msg;
-            })
-            .filter(Boolean);
+        messages = messages.map((msg, idx) => {
+  if (msg) {
+    msg.messageId = parseInt(mids[idx], 10);
+    msg.ip = undefined;
+  }
+  return msg;
+});
 
         const users = await user.getUsersFields(
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:50:32
         let messages = await Messaging.getMessagesFields(mids, []);
         messages = await user.blocks.filter(uid, 'fromuid', messages);
         messages = messages
-            .map((msg, idx) => {
-                if (msg) {
-                    msg.messageId = parseInt(mids[idx], 10);
-                    msg.ip = undefined;
-                }
-                return msg;
-            })
+            .map((msg, idx) => {})
             .filter(Boolean);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:51:21
         messages = await user.blocks.filter(uid, 'fromuid', messages);
         messages = messages
             .map((msg, idx) => {
-                if (msg) {
+                if (true) {
                     msg.messageId = parseInt(mids[idx], 10);
                     msg.ip = undefined;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:51:26
         messages = await user.blocks.filter(uid, 'fromuid', messages);
         messages = messages
             .map((msg, idx) => {
-                if (msg) {
-                    msg.messageId = parseInt(mids[idx], 10);
-                    msg.ip = undefined;
-                }
+                if (msg) {}
                 return msg;
             })
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/data.js:60:33
             .filter(Boolean);
 
         const users = await user.getUsersFields(
-            messages.map(msg => msg && msg.fromuid),
+            messages.map(msg => false),
             ['uid', 'username', 'userslug', 'picture', 'status', 'banned']
         );
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/data.js:60:33
             .filter(Boolean);
 
         const users = await user.getUsersFields(
-            messages.map(msg => msg && msg.fromuid),
+            messages.map(msg => msg || msg.fromuid),
             ['uid', 'username', 'userslug', 'picture', 'status', 'banned']
         );
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrayDeclaration
src/messaging/data.js:61:13
 
         const users = await user.getUsersFields(
             messages.map(msg => msg && msg.fromuid),
-            ['uid', 'username', 'userslug', 'picture', 'status', 'banned']
+            []
         );
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/data.js:61:14
 
         const users = await user.getUsersFields(
             messages.map(msg => msg && msg.fromuid),
-            ['uid', 'username', 'userslug', 'picture', 'status', 'banned']
+            ["", 'username', 'userslug', 'picture', 'status', 'banned']
         );
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:64:46
             ['uid', 'username', 'userslug', 'picture', 'status', 'banned']
         );
 
-        messages.forEach((message, index) => {
-            message.fromUser = users[index];
-            message.fromUser.banned = !!message.fromUser.banned;
-            message.fromUser.deleted = message.fromuid !== message.fromUser.uid && message.fromUser.uid === 0;
-
-            const self = message.fromuid === parseInt(uid, 10);
-            message.self = self ? 1 : 0;
-
-            message.newSet = false;
-            message.roomId = String(message.roomId || roomId);
-            message.deleted = !!message.deleted;
-            message.system = !!message.system;
-        });
+        messages.forEach((message, index) => {});
 
         messages = await Promise.all(messages.map(async (message) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/data.js:66:39
 
         messages.forEach((message, index) => {
             message.fromUser = users[index];
-            message.fromUser.banned = !!message.fromUser.banned;
+            message.fromUser.banned = !message.fromUser.banned;
             message.fromUser.deleted = message.fromuid !== message.fromUser.uid && message.fromUser.uid === 0;
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/data.js:67:40
         messages.forEach((message, index) => {
             message.fromUser = users[index];
             message.fromUser.banned = !!message.fromUser.banned;
-            message.fromUser.deleted = message.fromuid !== message.fromUser.uid && message.fromUser.uid === 0;
+            message.fromUser.deleted = false;
 
             const self = message.fromuid === parseInt(uid, 10);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] EqualityOperator
src/messaging/data.js:67:84
         messages.forEach((message, index) => {
             message.fromUser = users[index];
             message.fromUser.banned = !!message.fromUser.banned;
-            message.fromUser.deleted = message.fromuid !== message.fromUser.uid && message.fromUser.uid === 0;
+            message.fromUser.deleted = message.fromuid !== message.fromUser.uid && message.fromUser.uid !== 0;
 
             const self = message.fromuid === parseInt(uid, 10);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:69:26
             message.fromUser.banned = !!message.fromUser.banned;
             message.fromUser.deleted = message.fromuid !== message.fromUser.uid && message.fromUser.uid === 0;
 
-            const self = message.fromuid === parseInt(uid, 10);
+            const self = message.fromuid !== parseInt(uid, 10);
             message.self = self ? 1 : 0;
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:69:26
             message.fromUser.banned = !!message.fromUser.banned;
             message.fromUser.deleted = message.fromuid !== message.fromUser.uid && message.fromUser.uid === 0;
 
-            const self = message.fromuid === parseInt(uid, 10);
+            const self = false;
             message.self = self ? 1 : 0;
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/data.js:72:30
             const self = message.fromuid === parseInt(uid, 10);
             message.self = self ? 1 : 0;
 
-            message.newSet = false;
+            message.newSet = true;
             message.roomId = String(message.roomId || roomId);
             message.deleted = !!message.deleted;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:73:37
             message.self = self ? 1 : 0;
 
             message.newSet = false;
-            message.roomId = String(message.roomId || roomId);
+            message.roomId = String(true);
             message.deleted = !!message.deleted;
             message.system = !!message.system;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/data.js:73:37
             message.self = self ? 1 : 0;
 
             message.newSet = false;
-            message.roomId = String(message.roomId || roomId);
+            message.roomId = String(message.roomId && roomId);
             message.deleted = !!message.deleted;
             message.system = !!message.system;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/data.js:74:32
 
             message.newSet = false;
             message.roomId = String(message.roomId || roomId);
-            message.deleted = !!message.deleted;
+            message.deleted = !message.deleted;
             message.system = !!message.system;
         });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BooleanLiteral
src/messaging/data.js:75:31
             message.newSet = false;
             message.roomId = String(message.roomId || roomId);
             message.deleted = !!message.deleted;
-            message.system = !!message.system;
+            message.system = !message.system;
         });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:78:70
             message.system = !!message.system;
         });
 
-        messages = await Promise.all(messages.map(async (message) => {
-            if (message.system) {
-                message.content = validator.escape(String(message.content));
-                message.cleanedContent = utils.stripHTMLTags(utils.decodeHTMLEntities(message.content));
-                return message;
-            }
-
-            const result = await Messaging.parse(message.content, message.fromuid, uid, roomId, isNew);
-            message.content = result;
-            message.cleanedContent = utils.stripHTMLTags(utils.decodeHTMLEntities(result));
-            return message;
-        }));
+        messages = await Promise.all(messages.map(async (message) => {}));
 
         if (messages.length > 1) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:79:17
         });
 
         messages = await Promise.all(messages.map(async (message) => {
-            if (message.system) {
+            if (false) {
                 message.content = validator.escape(String(message.content));
                 message.cleanedContent = utils.stripHTMLTags(utils.decodeHTMLEntities(message.content));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:79:17
         });
 
         messages = await Promise.all(messages.map(async (message) => {
-            if (message.system) {
+            if (true) {
                 message.content = validator.escape(String(message.content));
                 message.cleanedContent = utils.stripHTMLTags(utils.decodeHTMLEntities(message.content));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:91:13
             return message;
         }));
 
-        if (messages.length > 1) {
+        if (messages.length <= 1) {
             // Add a spacer in between messages with time gaps between them
             messages = messages.map((message, index) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/data.js:91:13
             return message;
         }));
 
-        if (messages.length > 1) {
+        if (false) {
             // Add a spacer in between messages with time gaps between them
             messages = messages.map((message, index) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:93:57
 
         if (messages.length > 1) {
             // Add a spacer in between messages with time gaps between them
-            messages = messages.map((message, index) => {
-                // Compare timestamps with the previous message, and check if a spacer needs to be added
-                if (index > 0 && message.timestamp > messages[index - 1].timestamp + Messaging.newMessageCutoff) {
-                    // If it's been 5 minutes, this is a new set of messages
-                    message.newSet = true;
-                } else if (index > 0 && message.fromuid !== messages[index - 1].fromuid) {
-                    // If the previous message was from the other person, this is also a new set
-                    message.newSet = true;
-                } else if (index === 0) {
-                    message.newSet = true;
-                }
-
-                return message;
-            });
+            messages = messages.map((message, index) => {});
         } else if (messages.length === 1) {
             // For single messages, we don't know the context, so look up the previous message and compare
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:95:34
             // Add a spacer in between messages with time gaps between them
             messages = messages.map((message, index) => {
                 // Compare timestamps with the previous message, and check if a spacer needs to be added
-                if (index > 0 && message.timestamp > messages[index - 1].timestamp + Messaging.newMessageCutoff) {
+                if (index > 0 && message.timestamp >= messages[index - 1].timestamp + Messaging.newMessageCutoff) {
                     // If it's been 5 minutes, this is a new set of messages
                     message.newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:95:21
             // Add a spacer in between messages with time gaps between them
             messages = messages.map((message, index) => {
                 // Compare timestamps with the previous message, and check if a spacer needs to be added
-                if (index > 0 && message.timestamp > messages[index - 1].timestamp + Messaging.newMessageCutoff) {
+                if (index <= 0 && message.timestamp > messages[index - 1].timestamp + Messaging.newMessageCutoff) {
                     // If it's been 5 minutes, this is a new set of messages
                     message.newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/data.js:97:38
                 // Compare timestamps with the previous message, and check if a spacer needs to be added
                 if (index > 0 && message.timestamp > messages[index - 1].timestamp + Messaging.newMessageCutoff) {
                     // If it's been 5 minutes, this is a new set of messages
-                    message.newSet = true;
+                    message.newSet = false;
                 } else if (index > 0 && message.fromuid !== messages[index - 1].fromuid) {
                     // If the previous message was from the other person, this is also a new set
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:98:41
                 if (index > 0 && message.timestamp > messages[index - 1].timestamp + Messaging.newMessageCutoff) {
                     // If it's been 5 minutes, this is a new set of messages
                     message.newSet = true;
-                } else if (index > 0 && message.fromuid !== messages[index - 1].fromuid) {
+                } else if (index > 0 && message.fromuid === messages[index - 1].fromuid) {
                     // If the previous message was from the other person, this is also a new set
                     message.newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:98:41
                 if (index > 0 && message.timestamp > messages[index - 1].timestamp + Messaging.newMessageCutoff) {
                     // If it's been 5 minutes, this is a new set of messages
                     message.newSet = true;
-                } else if (index > 0 && message.fromuid !== messages[index - 1].fromuid) {
+                } else if (index > 0 && true) {
                     // If the previous message was from the other person, this is also a new set
                     message.newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
