[Killed] ArrowFunction
src/messaging/index.js:23:27
 require('./unread')(Messaging);
 require('./notifications')(Messaging);
 
-Messaging.messageExists = async mid => db.exists(`message:${mid}`);
+Messaging.messageExists = () => undefined;
 
 Messaging.getMessages = async (params) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:26:19
 Messaging.messageExists = async mid => db.exists(`message:${mid}`);
 
 Messaging.getMessages = async (params) => {
-    const isNew = params.isNew || false;
+    const isNew = true;
     const start = params.hasOwnProperty('start') ? params.start : 0;
     const stop = parseInt(start, 10) + ((params.count || 50) - 1);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:26:35
 Messaging.messageExists = async mid => db.exists(`message:${mid}`);
 
 Messaging.getMessages = async (params) => {
-    const isNew = params.isNew || false;
+    const isNew = params.isNew || true;
     const start = params.hasOwnProperty('start') ? params.start : 0;
     const stop = parseInt(start, 10) + ((params.count || 50) - 1);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:27:41
 
 Messaging.getMessages = async (params) => {
     const isNew = params.isNew || false;
-    const start = params.hasOwnProperty('start') ? params.start : 0;
+    const start = params.hasOwnProperty("") ? params.start : 0;
     const stop = parseInt(start, 10) + ((params.count || 50) - 1);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/messaging/index.js:28:18
 Messaging.getMessages = async (params) => {
     const isNew = params.isNew || false;
     const start = params.hasOwnProperty('start') ? params.start : 0;
-    const stop = parseInt(start, 10) + ((params.count || 50) - 1);
+    const stop = parseInt(start, 10) - ((params.count || 50) - 1);
 
     const indices = {};
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:28:42
 Messaging.getMessages = async (params) => {
     const isNew = params.isNew || false;
     const start = params.hasOwnProperty('start') ? params.start : 0;
-    const stop = parseInt(start, 10) + ((params.count || 50) - 1);
+    const stop = parseInt(start, 10) + ((true) - 1);
 
     const indices = {};
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:31:29
     const stop = parseInt(start, 10) + ((params.count || 50) - 1);
 
     const indices = {};
-    const ok = await canGet('filter:messaging.canGetMessages', params.callerUid, params.uid);
+    const ok = await canGet("", params.callerUid, params.uid);
     if (!ok) {
         return;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:32:14
 
     const indices = {};
     const ok = await canGet('filter:messaging.canGetMessages', params.callerUid, params.uid);
-    if (!ok) {
-        return;
-    }
+    if (!ok) {}
 
     const mids = await db.getSortedSetRevRange(`uid:${params.uid}:chat:room:${params.roomId}:mids`, start, stop);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:32:9
 
     const indices = {};
     const ok = await canGet('filter:messaging.canGetMessages', params.callerUid, params.uid);
-    if (!ok) {
+    if (ok) {
         return;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BooleanLiteral
src/messaging/index.js:37:9
     }
 
     const mids = await db.getSortedSetRevRange(`uid:${params.uid}:chat:room:${params.roomId}:mids`, start, stop);
-    if (!mids.length) {
+    if (mids.length) {
         return [];
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:37:9
     }
 
     const mids = await db.getSortedSetRevRange(`uid:${params.uid}:chat:room:${params.roomId}:mids`, start, stop);
-    if (!mids.length) {
+    if (true) {
         return [];
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/index.js:40:34
     if (!mids.length) {
         return [];
     }
-    mids.forEach((mid, index) => {
-        indices[mid] = start + index;
-    });
+    mids.forEach((mid, index) => {});
     mids.reverse();
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/messaging/index.js:41:24
         return [];
     }
     mids.forEach((mid, index) => {
-        indices[mid] = start + index;
+        indices[mid] = start - index;
     });
     mids.reverse();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] MethodExpression
src/messaging/index.js:43:5
     mids.forEach((mid, index) => {
         indices[mid] = start + index;
     });
-    mids.reverse();
+    mids;
 
     const messageData = await Messaging.getMessagesData(mids, params.uid, params.roomId, isNew);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:46:42
     mids.reverse();
 
     const messageData = await Messaging.getMessagesData(mids, params.uid, params.roomId, isNew);
-    messageData.forEach((messageData) => {
-        messageData.index = indices[messageData.messageId.toString()];
-        messageData.isOwner = messageData.fromuid === parseInt(params.uid, 10);
-        if (messageData.deleted && !messageData.isOwner) {
-            messageData.content = '[[modules:chat.message-deleted]]';
-            messageData.cleanedContent = messageData.content;
-        }
-    });
+    messageData.forEach((messageData) => {});
 
     return messageData;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:48:31
     const messageData = await Messaging.getMessagesData(mids, params.uid, params.roomId, isNew);
     messageData.forEach((messageData) => {
         messageData.index = indices[messageData.messageId.toString()];
-        messageData.isOwner = messageData.fromuid === parseInt(params.uid, 10);
+        messageData.isOwner = true;
         if (messageData.deleted && !messageData.isOwner) {
             messageData.content = '[[modules:chat.message-deleted]]';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:48:31
     const messageData = await Messaging.getMessagesData(mids, params.uid, params.roomId, isNew);
     messageData.forEach((messageData) => {
         messageData.index = indices[messageData.messageId.toString()];
-        messageData.isOwner = messageData.fromuid === parseInt(params.uid, 10);
+        messageData.isOwner = false;
         if (messageData.deleted && !messageData.isOwner) {
             messageData.content = '[[modules:chat.message-deleted]]';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/index.js:49:58
     messageData.forEach((messageData) => {
         messageData.index = indices[messageData.messageId.toString()];
         messageData.isOwner = messageData.fromuid === parseInt(params.uid, 10);
-        if (messageData.deleted && !messageData.isOwner) {
-            messageData.content = '[[modules:chat.message-deleted]]';
-            messageData.cleanedContent = messageData.content;
-        }
+        if (messageData.deleted && !messageData.isOwner) {}
     });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/index.js:49:13
     messageData.forEach((messageData) => {
         messageData.index = indices[messageData.messageId.toString()];
         messageData.isOwner = messageData.fromuid === parseInt(params.uid, 10);
-        if (messageData.deleted && !messageData.isOwner) {
+        if (messageData.deleted || !messageData.isOwner) {
             messageData.content = '[[modules:chat.message-deleted]]';
             messageData.cleanedContent = messageData.content;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:50:35
         messageData.index = indices[messageData.messageId.toString()];
         messageData.isOwner = messageData.fromuid === parseInt(params.uid, 10);
         if (messageData.deleted && !messageData.isOwner) {
-            messageData.content = '[[modules:chat.message-deleted]]';
+            messageData.content = "";
             messageData.cleanedContent = messageData.content;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/index.js:58:45
     return messageData;
 };
 
-async function canGet(hook, callerUid, uid) {
-    const data = await plugins.hooks.fire(hook, {
-        callerUid: callerUid,
-        uid: uid,
-        canGet: parseInt(callerUid, 10) === parseInt(uid, 10),
-    });
-
-    return data ? data.canGet : false;
-}
+async function canGet(hook, callerUid, uid) {}
 
 Messaging.parse = async (message, fromuid, uid, roomId, isNew) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/index.js:62:17
     const data = await plugins.hooks.fire(hook, {
         callerUid: callerUid,
         uid: uid,
-        canGet: parseInt(callerUid, 10) === parseInt(uid, 10),
+        canGet: parseInt(callerUid, 10) !== parseInt(uid, 10),
     });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:62:17
     const data = await plugins.hooks.fire(hook, {
         callerUid: callerUid,
         uid: uid,
-        canGet: parseInt(callerUid, 10) === parseInt(uid, 10),
+        canGet: false,
     });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:65:33
         canGet: parseInt(callerUid, 10) === parseInt(uid, 10),
     });
 
-    return data ? data.canGet : false;
+    return data ? data.canGet : true;
 }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:68:67
     return data ? data.canGet : false;
 }
 
-Messaging.parse = async (message, fromuid, uid, roomId, isNew) => {
-    const parsed = await plugins.hooks.fire('filter:parse.raw', String(message || ''));
-    let messageData = {
-        message: message,
-        parsed: parsed,
-        fromuid: fromuid,
-        uid: uid,
-        roomId: roomId,
-        isNew: isNew,
-        parsedMessage: parsed,
-    };
-
-    messageData = await plugins.hooks.fire('filter:messaging.parse', messageData);
-    return messageData ? messageData.parsedMessage : '';
-};
+Messaging.parse = async (message, fromuid, uid, roomId, isNew) => {};
 
 Messaging.isNewSet = async (uid, roomId, timestamp) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:69:72
 }
 
 Messaging.parse = async (message, fromuid, uid, roomId, isNew) => {
-    const parsed = await plugins.hooks.fire('filter:parse.raw', String(message || ''));
+    const parsed = await plugins.hooks.fire('filter:parse.raw', String(false));
     let messageData = {
         message: message,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/index.js:69:72
 }
 
 Messaging.parse = async (message, fromuid, uid, roomId, isNew) => {
-    const parsed = await plugins.hooks.fire('filter:parse.raw', String(message || ''));
+    const parsed = await plugins.hooks.fire('filter:parse.raw', String(message && ''));
     let messageData = {
         message: message,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/index.js:80:44
         parsedMessage: parsed,
     };
 
-    messageData = await plugins.hooks.fire('filter:messaging.parse', messageData);
+    messageData = await plugins.hooks.fire("", messageData);
     return messageData ? messageData.parsedMessage : '';
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:81:54
     };
 
     messageData = await plugins.hooks.fire('filter:messaging.parse', messageData);
-    return messageData ? messageData.parsedMessage : '';
+    return messageData ? messageData.parsedMessage : "Stryker was here!";
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/index.js:84:56
     return messageData ? messageData.parsedMessage : '';
 };
 
-Messaging.isNewSet = async (uid, roomId, timestamp) => {
-    const setKey = `uid:${uid}:chat:room:${roomId}:mids`;
-    const messages = await db.getSortedSetRevRangeWithScores(setKey, 0, 0);
-    if (messages && messages.length) {
-        return parseInt(timestamp, 10) > parseInt(messages[0].score, 10) + Messaging.newMessageCutoff;
-    }
-    return true;
-};
+Messaging.isNewSet = async (uid, roomId, timestamp) => {};
 
 Messaging.getRecentChats = async (callerUid, uid, start, stop) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:85:20
 };
 
 Messaging.isNewSet = async (uid, roomId, timestamp) => {
-    const setKey = `uid:${uid}:chat:room:${roomId}:mids`;
+    const setKey = ``;
     const messages = await db.getSortedSetRevRangeWithScores(setKey, 0, 0);
     if (messages && messages.length) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/index.js:87:9
 Messaging.isNewSet = async (uid, roomId, timestamp) => {
     const setKey = `uid:${uid}:chat:room:${roomId}:mids`;
     const messages = await db.getSortedSetRevRangeWithScores(setKey, 0, 0);
-    if (messages && messages.length) {
+    if (messages || messages.length) {
         return parseInt(timestamp, 10) > parseInt(messages[0].score, 10) + Messaging.newMessageCutoff;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:87:38
 Messaging.isNewSet = async (uid, roomId, timestamp) => {
     const setKey = `uid:${uid}:chat:room:${roomId}:mids`;
     const messages = await db.getSortedSetRevRangeWithScores(setKey, 0, 0);
-    if (messages && messages.length) {
-        return parseInt(timestamp, 10) > parseInt(messages[0].score, 10) + Messaging.newMessageCutoff;
-    }
+    if (messages && messages.length) {}
     return true;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:88:16
     const setKey = `uid:${uid}:chat:room:${roomId}:mids`;
     const messages = await db.getSortedSetRevRangeWithScores(setKey, 0, 0);
     if (messages && messages.length) {
-        return parseInt(timestamp, 10) > parseInt(messages[0].score, 10) + Messaging.newMessageCutoff;
+        return true;
     }
     return true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArithmeticOperator
src/messaging/index.js:88:42
     const setKey = `uid:${uid}:chat:room:${roomId}:mids`;
     const messages = await db.getSortedSetRevRangeWithScores(setKey, 0, 0);
     if (messages && messages.length) {
-        return parseInt(timestamp, 10) > parseInt(messages[0].score, 10) + Messaging.newMessageCutoff;
+        return parseInt(timestamp, 10) > parseInt(messages[0].score, 10) - Messaging.newMessageCutoff;
     }
     return true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:95:9
 
 Messaging.getRecentChats = async (callerUid, uid, start, stop) => {
     const ok = await canGet('filter:messaging.canGetRecentChats', callerUid, uid);
-    if (!ok) {
+    if (true) {
         return null;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:95:9
 
 Messaging.getRecentChats = async (callerUid, uid, start, stop) => {
     const ok = await canGet('filter:messaging.canGetRecentChats', callerUid, uid);
-    if (!ok) {
+    if (false) {
         return null;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:99:51
         return null;
     }
 
-    const roomIds = await db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, start, stop);
+    const roomIds = await db.getSortedSetRevRange(``, start, stop);
     const results = await utils.promiseParallel({
         roomData: Messaging.getRoomsData(roomIds),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:102:39
     const roomIds = await db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, start, stop);
     const results = await utils.promiseParallel({
         roomData: Messaging.getRoomsData(roomIds),
-        unread: db.isSortedSetMembers(`uid:${uid}:chat:rooms:unread`, roomIds),
+        unread: db.isSortedSetMembers(``, roomIds),
         users: Promise.all(roomIds.map(async (roomId) => {
             let uids = await db.getSortedSetRevRange(`chat:room:${roomId}:uids`, 0, 9);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:103:58
     const results = await utils.promiseParallel({
         roomData: Messaging.getRoomsData(roomIds),
         unread: db.isSortedSetMembers(`uid:${uid}:chat:rooms:unread`, roomIds),
-        users: Promise.all(roomIds.map(async (roomId) => {
-            let uids = await db.getSortedSetRevRange(`chat:room:${roomId}:uids`, 0, 9);
-            uids = uids.filter(_uid => _uid && parseInt(_uid, 10) !== parseInt(uid, 10));
-            return await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
-        })),
+        users: Promise.all(roomIds.map(async (roomId) => {})),
         teasers: Promise.all(roomIds.map(async roomId => Messaging.getTeaser(uid, roomId))),
     });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/index.js:105:40
         unread: db.isSortedSetMembers(`uid:${uid}:chat:rooms:unread`, roomIds),
         users: Promise.all(roomIds.map(async (roomId) => {
             let uids = await db.getSortedSetRevRange(`chat:room:${roomId}:uids`, 0, 9);
-            uids = uids.filter(_uid => _uid && parseInt(_uid, 10) !== parseInt(uid, 10));
+            uids = uids.filter(_uid => _uid || parseInt(_uid, 10) !== parseInt(uid, 10));
             return await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
         })),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrowFunction
src/messaging/index.js:105:32
         unread: db.isSortedSetMembers(`uid:${uid}:chat:rooms:unread`, roomIds),
         users: Promise.all(roomIds.map(async (roomId) => {
             let uids = await db.getSortedSetRevRange(`chat:room:${roomId}:uids`, 0, 9);
-            uids = uids.filter(_uid => _uid && parseInt(_uid, 10) !== parseInt(uid, 10));
+            uids = uids.filter(() => undefined);
             return await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
         })),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/index.js:106:52
         users: Promise.all(roomIds.map(async (roomId) => {
             let uids = await db.getSortedSetRevRange(`chat:room:${roomId}:uids`, 0, 9);
             uids = uids.filter(_uid => _uid && parseInt(_uid, 10) !== parseInt(uid, 10));
-            return await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
+            return await user.getUsersFields(uids, []);
         })),
         teasers: Promise.all(roomIds.map(async roomId => Messaging.getTeaser(uid, roomId))),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/index.js:108:42
             uids = uids.filter(_uid => _uid && parseInt(_uid, 10) !== parseInt(uid, 10));
             return await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
         })),
-        teasers: Promise.all(roomIds.map(async roomId => Messaging.getTeaser(uid, roomId))),
+        teasers: Promise.all(roomIds.map(() => undefined)),
     });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/index.js:111:47
         teasers: Promise.all(roomIds.map(async roomId => Messaging.getTeaser(uid, roomId))),
     });
 
-    results.roomData.forEach((room, index) => {
-        if (room) {
-            room.users = results.users[index];
-            room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : room.users.length > 2;
-            room.unread = results.unread[index];
-            room.teaser = results.teasers[index];
-
-            room.users.forEach((userData) => {
-                if (userData && parseInt(userData.uid, 10)) {
-                    userData.status = user.getStatus(userData);
-                }
-            });
-            room.users = room.users.filter(user => user && parseInt(user.uid, 10));
-            room.lastUser = room.users[0];
-
-            room.usernames = Messaging.generateUsernames(room.users, uid);
-        }
-    });
+    results.roomData.forEach((room, index) => {});
 
     results.roomData = results.roomData.filter(Boolean);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:112:13
     });
 
     results.roomData.forEach((room, index) => {
-        if (room) {
+        if (false) {
             room.users = results.users[index];
             room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : room.users.length > 2;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:112:19
     });
 
     results.roomData.forEach((room, index) => {
-        if (room) {
-            room.users = results.users[index];
-            room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : room.users.length > 2;
-            room.unread = results.unread[index];
-            room.teaser = results.teasers[index];
-
-            room.users.forEach((userData) => {
-                if (userData && parseInt(userData.uid, 10)) {
-                    userData.status = user.getStatus(userData);
-                }
-            });
-            room.users = room.users.filter(user => user && parseInt(user.uid, 10));
-            room.lastUser = room.users[0];
-
-            room.usernames = Messaging.generateUsernames(room.users, uid);
-        }
+        if (room) {}
     });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
