[Killed] ConditionalExpression
src/messaging/index.js:114:82
     results.roomData.forEach((room, index) => {
         if (room) {
             room.users = results.users[index];
-            room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : room.users.length > 2;
+            room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : false;
             room.unread = results.unread[index];
             room.teaser = results.teasers[index];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] EqualityOperator
src/messaging/index.js:114:82
     results.roomData.forEach((room, index) => {
         if (room) {
             room.users = results.users[index];
-            room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : room.users.length > 2;
+            room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : room.users.length <= 2;
             room.unread = results.unread[index];
             room.teaser = results.teasers[index];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:118:46
             room.unread = results.unread[index];
             room.teaser = results.teasers[index];
 
-            room.users.forEach((userData) => {
-                if (userData && parseInt(userData.uid, 10)) {
-                    userData.status = user.getStatus(userData);
-                }
-            });
+            room.users.forEach((userData) => {});
             room.users = room.users.filter(user => user && parseInt(user.uid, 10));
             room.lastUser = room.users[0];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:119:21
             room.teaser = results.teasers[index];
 
             room.users.forEach((userData) => {
-                if (userData && parseInt(userData.uid, 10)) {
+                if (false) {
                     userData.status = user.getStatus(userData);
                 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:119:21
             room.teaser = results.teasers[index];
 
             room.users.forEach((userData) => {
-                if (userData && parseInt(userData.uid, 10)) {
+                if (true) {
                     userData.status = user.getStatus(userData);
                 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:123:52
                     userData.status = user.getStatus(userData);
                 }
             });
-            room.users = room.users.filter(user => user && parseInt(user.uid, 10));
+            room.users = room.users.filter(user => false);
             room.lastUser = room.users[0];
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/index.js:123:44
                     userData.status = user.getStatus(userData);
                 }
             });
-            room.users = room.users.filter(user => user && parseInt(user.uid, 10));
+            room.users = room.users.filter(() => undefined);
             room.lastUser = room.users[0];
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] MethodExpression
src/messaging/index.js:130:24
         }
     });
 
-    results.roomData = results.roomData.filter(Boolean);
+    results.roomData = results.roomData;
     const ref = { rooms: results.roomData, nextStart: stop + 1 };
     return await plugins.hooks.fire('filter:messaging.getRecentChats', {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArithmeticOperator
src/messaging/index.js:131:55
     });
 
     results.roomData = results.roomData.filter(Boolean);
-    const ref = { rooms: results.roomData, nextStart: stop + 1 };
+    const ref = { rooms: results.roomData, nextStart: stop - 1 };
     return await plugins.hooks.fire('filter:messaging.getRecentChats', {
         rooms: ref.rooms,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/messaging/index.js:132:72
 
     results.roomData = results.roomData.filter(Boolean);
     const ref = { rooms: results.roomData, nextStart: stop + 1 };
-    return await plugins.hooks.fire('filter:messaging.getRecentChats', {
-        rooms: ref.rooms,
-        nextStart: ref.nextStart,
-        uid: uid,
-        callerUid: callerUid,
-    });
+    return await plugins.hooks.fire('filter:messaging.getRecentChats', {});
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/index.js:140:67
     });
 };
 
-Messaging.generateUsernames = (users, excludeUid) => users.filter(user => user && parseInt(user.uid, 10) !== excludeUid)
+Messaging.generateUsernames = (users, excludeUid) => users.filter(() => undefined)
     .map(user => user.username).join(', ');
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/index.js:140:75
     });
 };
 
-Messaging.generateUsernames = (users, excludeUid) => users.filter(user => user && parseInt(user.uid, 10) !== excludeUid)
+Messaging.generateUsernames = (users, excludeUid) => users.filter(user => user || parseInt(user.uid, 10) !== excludeUid)
     .map(user => user.username).join(', ');
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/index.js:141:10
 };
 
 Messaging.generateUsernames = (users, excludeUid) => users.filter(user => user && parseInt(user.uid, 10) !== excludeUid)
-    .map(user => user.username).join(', ');
+    .map(() => undefined).join(', ');
 
 Messaging.getTeaser = async (uid, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:143:46
 Messaging.generateUsernames = (users, excludeUid) => users.filter(user => user && parseInt(user.uid, 10) !== excludeUid)
     .map(user => user.username).join(', ');
 
-Messaging.getTeaser = async (uid, roomId) => {
-    const mid = await Messaging.getLatestUndeletedMessage(uid, roomId);
-    if (!mid) {
-        return null;
-    }
-    const teaser = await Messaging.getMessageFields(mid, ['fromuid', 'content', 'timestamp']);
-    if (!teaser.fromuid) {
-        return null;
-    }
-    const blocked = await user.blocks.is(teaser.fromuid, uid);
-    if (blocked) {
-        return null;
-    }
-
-    teaser.user = await user.getUserFields(teaser.fromuid, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
-    if (teaser.content) {
-        teaser.content = utils.stripHTMLTags(utils.decodeHTMLEntities(teaser.content));
-        teaser.content = validator.escape(String(teaser.content));
-    }
-
-    const payload = await plugins.hooks.fire('filter:messaging.getTeaser', { teaser: teaser });
-    return payload.teaser;
-};
+Messaging.getTeaser = async (uid, roomId) => {};
 
 Messaging.getLatestUndeletedMessage = async (uid, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:145:9
 
 Messaging.getTeaser = async (uid, roomId) => {
     const mid = await Messaging.getLatestUndeletedMessage(uid, roomId);
-    if (!mid) {
+    if (false) {
         return null;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:145:9
 
 Messaging.getTeaser = async (uid, roomId) => {
     const mid = await Messaging.getLatestUndeletedMessage(uid, roomId);
-    if (!mid) {
+    if (true) {
         return null;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:148:81
     if (!mid) {
         return null;
     }
-    const teaser = await Messaging.getMessageFields(mid, ['fromuid', 'content', 'timestamp']);
+    const teaser = await Messaging.getMessageFields(mid, ['fromuid', 'content', ""]);
     if (!teaser.fromuid) {
         return null;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:149:26
         return null;
     }
     const teaser = await Messaging.getMessageFields(mid, ['fromuid', 'content', 'timestamp']);
-    if (!teaser.fromuid) {
-        return null;
-    }
+    if (!teaser.fromuid) {}
     const blocked = await user.blocks.is(teaser.fromuid, uid);
     if (blocked) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:149:9
         return null;
     }
     const teaser = await Messaging.getMessageFields(mid, ['fromuid', 'content', 'timestamp']);
-    if (!teaser.fromuid) {
+    if (false) {
         return null;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:153:9
         return null;
     }
     const blocked = await user.blocks.is(teaser.fromuid, uid);
-    if (blocked) {
+    if (true) {
         return null;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:153:9
         return null;
     }
     const blocked = await user.blocks.is(teaser.fromuid, uid);
-    if (blocked) {
+    if (false) {
         return null;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:157:103
         return null;
     }
 
-    teaser.user = await user.getUserFields(teaser.fromuid, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
+    teaser.user = await user.getUserFields(teaser.fromuid, ['uid', 'username', 'userslug', 'picture', "", 'lastonline']);
     if (teaser.content) {
         teaser.content = utils.stripHTMLTags(utils.decodeHTMLEntities(teaser.content));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:157:68
         return null;
     }
 
-    teaser.user = await user.getUserFields(teaser.fromuid, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
+    teaser.user = await user.getUserFields(teaser.fromuid, ['uid', "", 'userslug', 'picture', 'status', 'lastonline']);
     if (teaser.content) {
         teaser.content = utils.stripHTMLTags(utils.decodeHTMLEntities(teaser.content));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:158:25
     }
 
     teaser.user = await user.getUserFields(teaser.fromuid, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
-    if (teaser.content) {
-        teaser.content = utils.stripHTMLTags(utils.decodeHTMLEntities(teaser.content));
-        teaser.content = validator.escape(String(teaser.content));
-    }
+    if (teaser.content) {}
 
     const payload = await plugins.hooks.fire('filter:messaging.getTeaser', { teaser: teaser });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:158:9
     }
 
     teaser.user = await user.getUserFields(teaser.fromuid, ['uid', 'username', 'userslug', 'picture', 'status', 'lastonline']);
-    if (teaser.content) {
+    if (true) {
         teaser.content = utils.stripHTMLTags(utils.decodeHTMLEntities(teaser.content));
         teaser.content = validator.escape(String(teaser.content));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/index.js:163:46
         teaser.content = validator.escape(String(teaser.content));
     }
 
-    const payload = await plugins.hooks.fire('filter:messaging.getTeaser', { teaser: teaser });
+    const payload = await plugins.hooks.fire("", { teaser: teaser });
     return payload.teaser;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:167:62
     return payload.teaser;
 };
 
-Messaging.getLatestUndeletedMessage = async (uid, roomId) => {
-    let done = false;
-    let latestMid = null;
-    let index = 0;
-    let mids;
-
-    while (!done) {
-        /* eslint-disable no-await-in-loop */
-        mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
-        if (mids.length) {
-            const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
-            done = !states.deleted && !states.system;
-            if (done) {
-                latestMid = mids[0];
-            }
-            index += 1;
-        } else {
-            done = true;
-        }
-    }
-
-    return latestMid;
-};
+Messaging.getLatestUndeletedMessage = async (uid, roomId) => {};
 
 Messaging.canMessageUser = async (uid, toUid) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:168:16
 };
 
 Messaging.getLatestUndeletedMessage = async (uid, roomId) => {
-    let done = false;
+    let done = true;
     let latestMid = null;
     let index = 0;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BooleanLiteral
src/messaging/index.js:173:12
     let index = 0;
     let mids;
 
-    while (!done) {
+    while (done) {
         /* eslint-disable no-await-in-loop */
         mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:173:12
     let index = 0;
     let mids;
 
-    while (!done) {
+    while (false) {
         /* eslint-disable no-await-in-loop */
         mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:176:13
     while (!done) {
         /* eslint-disable no-await-in-loop */
         mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
-        if (mids.length) {
+        if (false) {
             const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
             done = !states.deleted && !states.system;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:176:13
     while (!done) {
         /* eslint-disable no-await-in-loop */
         mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
-        if (mids.length) {
+        if (true) {
             const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
             done = !states.deleted && !states.system;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/index.js:177:70
         /* eslint-disable no-await-in-loop */
         mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
         if (mids.length) {
-            const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
+            const states = await Messaging.getMessageFields(mids[0], []);
             done = !states.deleted && !states.system;
             if (done) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:178:20
         mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
         if (mids.length) {
             const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
-            done = !states.deleted && !states.system;
+            done = true;
             if (done) {
                 latestMid = mids[0];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:178:39
         mids = await db.getSortedSetRevRange(`uid:${uid}:chat:room:${roomId}:mids`, index, index);
         if (mids.length) {
             const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
-            done = !states.deleted && !states.system;
+            done = !states.deleted && states.system;
             if (done) {
                 latestMid = mids[0];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:179:23
         if (mids.length) {
             const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
             done = !states.deleted && !states.system;
-            if (done) {
-                latestMid = mids[0];
-            }
+            if (done) {}
             index += 1;
         } else {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:179:17
         if (mids.length) {
             const states = await Messaging.getMessageFields(mids[0], ['deleted', 'system']);
             done = !states.deleted && !states.system;
-            if (done) {
+            if (true) {
                 latestMid = mids[0];
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] AssignmentOperator
src/messaging/index.js:182:13
             if (done) {
                 latestMid = mids[0];
             }
-            index += 1;
+            index -= 1;
         } else {
             done = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:183:16
                 latestMid = mids[0];
             }
             index += 1;
-        } else {
-            done = true;
-        }
+        } else {}
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:184:20
             }
             index += 1;
         } else {
-            done = true;
+            done = false;
         }
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/index.js:192:9
 };
 
 Messaging.canMessageUser = async (uid, toUid) => {
-    if (meta.config.disableChat || uid <= 0) {
+    if (meta.config.disableChat && uid <= 0) {
         throw new Error('[[error:chat-disabled]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:192:9
 };
 
 Messaging.canMessageUser = async (uid, toUid) => {
-    if (meta.config.disableChat || uid <= 0) {
+    if (true) {
         throw new Error('[[error:chat-disabled]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:196:52
         throw new Error('[[error:chat-disabled]]');
     }
 
-    if (parseInt(uid, 10) === parseInt(toUid, 10)) {
-        throw new Error('[[error:cant-chat-with-yourself]]');
-    }
+    if (parseInt(uid, 10) === parseInt(toUid, 10)) {}
     const [exists, canChat] = await Promise.all([
         user.exists(toUid),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:196:9
         throw new Error('[[error:chat-disabled]]');
     }
 
-    if (parseInt(uid, 10) === parseInt(toUid, 10)) {
+    if (true) {
         throw new Error('[[error:cant-chat-with-yourself]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:197:25
     }
 
     if (parseInt(uid, 10) === parseInt(toUid, 10)) {
-        throw new Error('[[error:cant-chat-with-yourself]]');
+        throw new Error("");
     }
     const [exists, canChat] = await Promise.all([
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:201:31
     }
     const [exists, canChat] = await Promise.all([
         user.exists(toUid),
-        privileges.global.can('chat', uid),
+        privileges.global.can("", uid),
         checkReputation(uid),
     ]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BooleanLiteral
src/messaging/index.js:205:9
         checkReputation(uid),
     ]);
 
-    if (!exists) {
+    if (exists) {
         throw new Error('[[error:no-user]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:205:9
         checkReputation(uid),
     ]);
 
-    if (!exists) {
+    if (true) {
         throw new Error('[[error:no-user]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BooleanLiteral
src/messaging/index.js:209:9
         throw new Error('[[error:no-user]]');
     }
 
-    if (!canChat) {
+    if (canChat) {
         throw new Error('[[error:no-privileges]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:209:9
         throw new Error('[[error:no-user]]');
     }
 
-    if (!canChat) {
+    if (false) {
         throw new Error('[[error:no-privileges]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrayDeclaration
src/messaging/index.js:213:88
         throw new Error('[[error:no-privileges]]');
     }
 
-    const [settings, isAdmin, isModerator, isFollowing, isBlocked] = await Promise.all([
-        user.getSettings(toUid),
-        user.isAdministrator(uid),
-        user.isModeratorOfAnyCategory(uid),
-        user.isFollowing(toUid, uid),
-        user.blocks.is(uid, toUid),
-    ]);
+    const [settings, isAdmin, isModerator, isFollowing, isBlocked] = await Promise.all([]);
 
     if (isBlocked || (settings.restrictChat && !isAdmin && !isModerator && !isFollowing)) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:221:48
         user.blocks.is(uid, toUid),
     ]);
 
-    if (isBlocked || (settings.restrictChat && !isAdmin && !isModerator && !isFollowing)) {
+    if (isBlocked || (settings.restrictChat && isAdmin && !isModerator && !isFollowing)) {
         throw new Error('[[error:chat-restricted]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/index.js:221:9
         user.blocks.is(uid, toUid),
     ]);
 
-    if (isBlocked || (settings.restrictChat && !isAdmin && !isModerator && !isFollowing)) {
+    if (isBlocked && settings.restrictChat && !isAdmin && !isModerator && !isFollowing) {
         throw new Error('[[error:chat-restricted]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
