[Killed] BooleanLiteral
src/messaging/data.js:100:38
                     message.newSet = true;
                 } else if (index > 0 && message.fromuid !== messages[index - 1].fromuid) {
                     // If the previous message was from the other person, this is also a new set
-                    message.newSet = true;
+                    message.newSet = false;
                 } else if (index === 0) {
                     message.newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:101:28
                 } else if (index > 0 && message.fromuid !== messages[index - 1].fromuid) {
                     // If the previous message was from the other person, this is also a new set
                     message.newSet = true;
-                } else if (index === 0) {
+                } else if (index !== 0) {
                     message.newSet = true;
                 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/data.js:101:28
                 } else if (index > 0 && message.fromuid !== messages[index - 1].fromuid) {
                     // If the previous message was from the other person, this is also a new set
                     message.newSet = true;
-                } else if (index === 0) {
+                } else if (true) {
                     message.newSet = true;
                 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/data.js:102:38
                     // If the previous message was from the other person, this is also a new set
                     message.newSet = true;
                 } else if (index === 0) {
-                    message.newSet = true;
+                    message.newSet = false;
                 }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/data.js:107:43
 
                 return message;
             });
-        } else if (messages.length === 1) {
-            // For single messages, we don't know the context, so look up the previous message and compare
-            const key = `uid:${uid}:chat:room:${roomId}:mids`;
-            const index = await db.sortedSetRank(key, messages[0].messageId);
-            if (index > 0) {
-                const mid = await db.getSortedSetRange(key, index - 1, index - 1);
-                const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
-                if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
-                    (messages[0].fromuid !== fields.fromuid)) {
-                    // If it's been 5 minutes, this is a new set of messages
-                    messages[0].newSet = true;
-                }
-            } else {
-                messages[0].newSet = true;
-            }
-        } else {
+        } else if (messages.length === 1) {} else {
             messages = [];
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] EqualityOperator
src/messaging/data.js:107:20
 
                 return message;
             });
-        } else if (messages.length === 1) {
+        } else if (messages.length !== 1) {
             // For single messages, we don't know the context, so look up the previous message and compare
             const key = `uid:${uid}:chat:room:${roomId}:mids`;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/data.js:109:25
             });
         } else if (messages.length === 1) {
             // For single messages, we don't know the context, so look up the previous message and compare
-            const key = `uid:${uid}:chat:room:${roomId}:mids`;
+            const key = ``;
             const index = await db.sortedSetRank(key, messages[0].messageId);
             if (index > 0) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:111:17
             // For single messages, we don't know the context, so look up the previous message and compare
             const key = `uid:${uid}:chat:room:${roomId}:mids`;
             const index = await db.sortedSetRank(key, messages[0].messageId);
-            if (index > 0) {
+            if (index <= 0) {
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:111:17
             // For single messages, we don't know the context, so look up the previous message and compare
             const key = `uid:${uid}:chat:room:${roomId}:mids`;
             const index = await db.sortedSetRank(key, messages[0].messageId);
-            if (index > 0) {
+            if (index >= 0) {
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArithmeticOperator
src/messaging/data.js:112:72
             const key = `uid:${uid}:chat:room:${roomId}:mids`;
             const index = await db.sortedSetRank(key, messages[0].messageId);
             if (index > 0) {
-                const mid = await db.getSortedSetRange(key, index - 1, index - 1);
+                const mid = await db.getSortedSetRange(key, index - 1, index + 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
                 if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/messaging/data.js:112:61
             const key = `uid:${uid}:chat:room:${roomId}:mids`;
             const index = await db.sortedSetRank(key, messages[0].messageId);
             if (index > 0) {
-                const mid = await db.getSortedSetRange(key, index - 1, index - 1);
+                const mid = await db.getSortedSetRange(key, index + 1, index - 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
                 if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/data.js:113:70
             const index = await db.sortedSetRank(key, messages[0].messageId);
             if (index > 0) {
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
-                const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
+                const fields = await Messaging.getMessageFields(mid, []);
                 if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
                     (messages[0].fromuid !== fields.fromuid)) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/data.js:113:71
             const index = await db.sortedSetRank(key, messages[0].messageId);
             if (index > 0) {
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
-                const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
+                const fields = await Messaging.getMessageFields(mid, ["", 'timestamp']);
                 if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
                     (messages[0].fromuid !== fields.fromuid)) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/data.js:114:21
             if (index > 0) {
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
-                if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
-                    (messages[0].fromuid !== fields.fromuid)) {
+                if (messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff && messages[0].fromuid !== fields.fromuid) {
                     // If it's been 5 minutes, this is a new set of messages
                     messages[0].newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:114:21
             if (index > 0) {
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
-                if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
-                    (messages[0].fromuid !== fields.fromuid)) {
+                if (false) {
                     // If it's been 5 minutes, this is a new set of messages
                     messages[0].newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/data.js:115:22
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
                 if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
-                    (messages[0].fromuid !== fields.fromuid)) {
+                    (messages[0].fromuid === fields.fromuid)) {
                     // If it's been 5 minutes, this is a new set of messages
                     messages[0].newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:115:63
                 const mid = await db.getSortedSetRange(key, index - 1, index - 1);
                 const fields = await Messaging.getMessageFields(mid, ['fromuid', 'timestamp']);
                 if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
-                    (messages[0].fromuid !== fields.fromuid)) {
-                    // If it's been 5 minutes, this is a new set of messages
-                    messages[0].newSet = true;
-                }
+                    (messages[0].fromuid !== fields.fromuid)) {}
             } else {
                 messages[0].newSet = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/data.js:117:42
                 if ((messages[0].timestamp > fields.timestamp + Messaging.newMessageCutoff) ||
                     (messages[0].fromuid !== fields.fromuid)) {
                     // If it's been 5 minutes, this is a new set of messages
-                    messages[0].newSet = true;
+                    messages[0].newSet = false;
                 }
             } else {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:119:20
                     // If it's been 5 minutes, this is a new set of messages
                     messages[0].newSet = true;
                 }
-            } else {
-                messages[0].newSet = true;
-            }
+            } else {}
         } else {
             messages = [];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/data.js:120:38
                     messages[0].newSet = true;
                 }
             } else {
-                messages[0].newSet = true;
+                messages[0].newSet = false;
             }
         } else {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/data.js:122:16
             } else {
                 messages[0].newSet = true;
             }
-        } else {
-            messages = [];
-        }
+        } else {}
 
         const data = await plugins.hooks.fire('filter:messaging.getMessages', {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/messaging/data.js:126:79
             messages = [];
         }
 
-        const data = await plugins.hooks.fire('filter:messaging.getMessages', {
-            messages: messages,
-            uid: uid,
-            roomId: roomId,
-            isNew: isNew,
-            mids: mids,
-        });
+        const data = await plugins.hooks.fire('filter:messaging.getMessages', {});
 
         return data && data.messages;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/data.js:134:16
             mids: mids,
         });
 
-        return data && data.messages;
+        return data || data.messages;
     };
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:134:16
             mids: mids,
         });
 
-        return data && data.messages;
+        return true;
     };
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:138:52
     };
 };
 
-async function modifyMessage(message, fields, mid) {
-    if (message) {
-        db.parseIntFields(message, intFields, fields);
-        if (message.hasOwnProperty('timestamp')) {
-            message.timestampISO = utils.toISOString(message.timestamp);
-        }
-        if (message.hasOwnProperty('edited')) {
-            message.editedISO = utils.toISOString(message.edited);
-        }
-    }
-
-    const payload = await plugins.hooks.fire('filter:messaging.getFields', {
-        mid: mid,
-        message: message,
-        fields: fields,
-    });
-
-    return payload.message;
-}
+async function modifyMessage(message, fields, mid) {}
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:139:9
 };
 
 async function modifyMessage(message, fields, mid) {
-    if (message) {
+    if (false) {
         db.parseIntFields(message, intFields, fields);
         if (message.hasOwnProperty('timestamp')) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:139:18
 };
 
 async function modifyMessage(message, fields, mid) {
-    if (message) {
-        db.parseIntFields(message, intFields, fields);
-        if (message.hasOwnProperty('timestamp')) {
-            message.timestampISO = utils.toISOString(message.timestamp);
-        }
-        if (message.hasOwnProperty('edited')) {
-            message.editedISO = utils.toISOString(message.edited);
-        }
-    }
+    if (message) {}
 
     const payload = await plugins.hooks.fire('filter:messaging.getFields', {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:141:13
 async function modifyMessage(message, fields, mid) {
     if (message) {
         db.parseIntFields(message, intFields, fields);
-        if (message.hasOwnProperty('timestamp')) {
+        if (true) {
             message.timestampISO = utils.toISOString(message.timestamp);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:141:13
 async function modifyMessage(message, fields, mid) {
     if (message) {
         db.parseIntFields(message, intFields, fields);
-        if (message.hasOwnProperty('timestamp')) {
+        if (false) {
             message.timestampISO = utils.toISOString(message.timestamp);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/data.js:144:13
         if (message.hasOwnProperty('timestamp')) {
             message.timestampISO = utils.toISOString(message.timestamp);
         }
-        if (message.hasOwnProperty('edited')) {
+        if (false) {
             message.editedISO = utils.toISOString(message.edited);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/data.js:144:47
         if (message.hasOwnProperty('timestamp')) {
             message.timestampISO = utils.toISOString(message.timestamp);
         }
-        if (message.hasOwnProperty('edited')) {
-            message.editedISO = utils.toISOString(message.edited);
-        }
+        if (message.hasOwnProperty('edited')) {}
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
