[Killed] BlockStatement
src/messaging/index.js:231:51
     });
 };
 
-Messaging.canMessageRoom = async (uid, roomId) => {
-    if (meta.config.disableChat || uid <= 0) {
-        throw new Error('[[error:chat-disabled]]');
-    }
-
-    const [inRoom, canChat] = await Promise.all([
-        Messaging.isUserInRoom(uid, roomId),
-        privileges.global.can('chat', uid),
-        checkReputation(uid),
-    ]);
-
-    if (!inRoom) {
-        throw new Error('[[error:not-in-room]]');
-    }
-
-    if (!canChat) {
-        throw new Error('[[error:no-privileges]]');
-    }
-
-    await plugins.hooks.fire('static:messaging.canMessageRoom', {
-        uid: uid,
-        roomId: roomId,
-    });
-};
+Messaging.canMessageRoom = async (uid, roomId) => {};
 
 async function checkReputation(uid) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:232:9
 };
 
 Messaging.canMessageRoom = async (uid, roomId) => {
-    if (meta.config.disableChat || uid <= 0) {
+    if (false) {
         throw new Error('[[error:chat-disabled]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:232:36
 };
 
 Messaging.canMessageRoom = async (uid, roomId) => {
-    if (meta.config.disableChat || uid <= 0) {
+    if (meta.config.disableChat || false) {
         throw new Error('[[error:chat-disabled]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/index.js:238:31
 
     const [inRoom, canChat] = await Promise.all([
         Messaging.isUserInRoom(uid, roomId),
-        privileges.global.can('chat', uid),
+        privileges.global.can("", uid),
         checkReputation(uid),
     ]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:242:9
         checkReputation(uid),
     ]);
 
-    if (!inRoom) {
+    if (false) {
         throw new Error('[[error:not-in-room]]');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:242:18
         checkReputation(uid),
     ]);
 
-    if (!inRoom) {
-        throw new Error('[[error:not-in-room]]');
-    }
+    if (!inRoom) {}
 
     if (!canChat) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:243:25
     ]);
 
     if (!inRoom) {
-        throw new Error('[[error:not-in-room]]');
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:256:37
     });
 };
 
-async function checkReputation(uid) {
-    if (meta.config['min:rep:chat'] > 0) {
-        const reputation = await user.getUserField(uid, 'reputation');
-        if (meta.config['min:rep:chat'] > reputation) {
-            throw new Error(`[[error:not-enough-reputation-to-chat, ${meta.config['min:rep:chat']}]]`);
-        }
-    }
-}
+async function checkReputation(uid) {}
 
 Messaging.hasPrivateChat = async (uid, withUid) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:257:9
 };
 
 async function checkReputation(uid) {
-    if (meta.config['min:rep:chat'] > 0) {
+    if (true) {
         const reputation = await user.getUserField(uid, 'reputation');
         if (meta.config['min:rep:chat'] > reputation) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:257:9
 };
 
 async function checkReputation(uid) {
-    if (meta.config['min:rep:chat'] > 0) {
+    if (false) {
         const reputation = await user.getUserField(uid, 'reputation');
         if (meta.config['min:rep:chat'] > reputation) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/index.js:259:13
 async function checkReputation(uid) {
     if (meta.config['min:rep:chat'] > 0) {
         const reputation = await user.getUserField(uid, 'reputation');
-        if (meta.config['min:rep:chat'] > reputation) {
+        if (meta.config['min:rep:chat'] <= reputation) {
             throw new Error(`[[error:not-enough-reputation-to-chat, ${meta.config['min:rep:chat']}]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:259:13
 async function checkReputation(uid) {
     if (meta.config['min:rep:chat'] > 0) {
         const reputation = await user.getUserField(uid, 'reputation');
-        if (meta.config['min:rep:chat'] > reputation) {
+        if (true) {
             throw new Error(`[[error:not-enough-reputation-to-chat, ${meta.config['min:rep:chat']}]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/index.js:260:29
     if (meta.config['min:rep:chat'] > 0) {
         const reputation = await user.getUserField(uid, 'reputation');
         if (meta.config['min:rep:chat'] > reputation) {
-            throw new Error(`[[error:not-enough-reputation-to-chat, ${meta.config['min:rep:chat']}]]`);
+            throw new Error(``);
         }
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/index.js:266:9
 }
 
 Messaging.hasPrivateChat = async (uid, withUid) => {
-    if (parseInt(uid, 10) === parseInt(withUid, 10)) {
+    if (parseInt(uid, 10) !== parseInt(withUid, 10)) {
         return 0;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:266:9
 }
 
 Messaging.hasPrivateChat = async (uid, withUid) => {
-    if (parseInt(uid, 10) === parseInt(withUid, 10)) {
+    if (true) {
         return 0;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] UnaryOperator
src/messaging/index.js:271:70
     }
 
     const results = await utils.promiseParallel({
-        myRooms: db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, 0, -1),
+        myRooms: db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, 0, +1),
         theirRooms: db.getSortedSetRevRange(`uid:${withUid}:chat:rooms`, 0, -1),
     });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] UnaryOperator
src/messaging/index.js:272:77
 
     const results = await utils.promiseParallel({
         myRooms: db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, 0, -1),
-        theirRooms: db.getSortedSetRevRange(`uid:${withUid}:chat:rooms`, 0, -1),
+        theirRooms: db.getSortedSetRevRange(`uid:${withUid}:chat:rooms`, 0, +1),
     });
     const roomIds = results.myRooms.filter(roomId => roomId && results.theirRooms.includes(roomId));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/index.js:272:45
 
     const results = await utils.promiseParallel({
         myRooms: db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, 0, -1),
-        theirRooms: db.getSortedSetRevRange(`uid:${withUid}:chat:rooms`, 0, -1),
+        theirRooms: db.getSortedSetRevRange(``, 0, -1),
     });
     const roomIds = results.myRooms.filter(roomId => roomId && results.theirRooms.includes(roomId));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:274:54
         myRooms: db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, 0, -1),
         theirRooms: db.getSortedSetRevRange(`uid:${withUid}:chat:rooms`, 0, -1),
     });
-    const roomIds = results.myRooms.filter(roomId => roomId && results.theirRooms.includes(roomId));
+    const roomIds = results.myRooms.filter(roomId => false);
 
     if (!roomIds.length) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:274:54
         myRooms: db.getSortedSetRevRange(`uid:${uid}:chat:rooms`, 0, -1),
         theirRooms: db.getSortedSetRevRange(`uid:${withUid}:chat:rooms`, 0, -1),
     });
-    const roomIds = results.myRooms.filter(roomId => roomId && results.theirRooms.includes(roomId));
+    const roomIds = results.myRooms.filter(roomId => true);
 
     if (!roomIds.length) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:276:26
     });
     const roomIds = results.myRooms.filter(roomId => roomId && results.theirRooms.includes(roomId));
 
-    if (!roomIds.length) {
-        return 0;
-    }
+    if (!roomIds.length) {}
 
     let index = 0;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:276:9
     });
     const roomIds = results.myRooms.filter(roomId => roomId && results.theirRooms.includes(roomId));
 
-    if (!roomIds.length) {
+    if (false) {
         return 0;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/index.js:282:12
 
     let index = 0;
     let roomId = 0;
-    while (index < roomIds.length && !roomId) {
+    while (false) {
         /* eslint-disable no-await-in-loop */
         const count = await Messaging.getUserCountInRoom(roomIds[index]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/index.js:282:12
 
     let index = 0;
     let roomId = 0;
-    while (index < roomIds.length && !roomId) {
+    while (index < roomIds.length || !roomId) {
         /* eslint-disable no-await-in-loop */
         const count = await Messaging.getUserCountInRoom(roomIds[index]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:285:26
     while (index < roomIds.length && !roomId) {
         /* eslint-disable no-await-in-loop */
         const count = await Messaging.getUserCountInRoom(roomIds[index]);
-        if (count === 2) {
-            roomId = roomIds[index];
-        } else {
+        if (count === 2) {} else {
             index += 1;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:285:13
     while (index < roomIds.length && !roomId) {
         /* eslint-disable no-await-in-loop */
         const count = await Messaging.getUserCountInRoom(roomIds[index]);
-        if (count === 2) {
+        if (false) {
             roomId = roomIds[index];
         } else {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:287:16
         const count = await Messaging.getUserCountInRoom(roomIds[index]);
         if (count === 2) {
             roomId = roomIds[index];
-        } else {
-            index += 1;
-        }
+        } else {}
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] AssignmentOperator
src/messaging/index.js:288:13
         if (count === 2) {
             roomId = roomIds[index];
         } else {
-            index += 1;
+            index -= 1;
         }
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/index.js:295:57
     return roomId;
 };
 
-Messaging.canViewMessage = async (mids, roomId, uid) => {
-    let single = false;
-    if (!Array.isArray(mids) && isFinite(mids)) {
-        mids = [mids];
-        single = true;
-    }
-
-    const canView = await db.isSortedSetMembers(`uid:${uid}:chat:room:${roomId}:mids`, mids);
-    return single ? canView.pop() : canView;
-};
+Messaging.canViewMessage = async (mids, roomId, uid) => {};
 
 require('../promisify')(Messaging);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/index.js:296:18
 };
 
 Messaging.canViewMessage = async (mids, roomId, uid) => {
-    let single = false;
+    let single = true;
     if (!Array.isArray(mids) && isFinite(mids)) {
         mids = [mids];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/index.js:297:9
 
 Messaging.canViewMessage = async (mids, roomId, uid) => {
     let single = false;
-    if (!Array.isArray(mids) && isFinite(mids)) {
+    if (true) {
         mids = [mids];
         single = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/index.js:297:9
 
 Messaging.canViewMessage = async (mids, roomId, uid) => {
     let single = false;
-    if (!Array.isArray(mids) && isFinite(mids)) {
+    if (!Array.isArray(mids) || isFinite(mids)) {
         mids = [mids];
         single = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BooleanLiteral
src/messaging/index.js:299:18
     let single = false;
     if (!Array.isArray(mids) && isFinite(mids)) {
         mids = [mids];
-        single = true;
+        single = false;
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",
