[Killed] ArrowFunction
src/messaging/delete.js:6:31
 const sockets = require('../socket.io');
 
 module.exports = function (Messaging) {
-    Messaging.deleteMessage = async (mid, uid) => await doDeleteRestore(mid, 1, uid);
+    Messaging.deleteMessage = () => undefined;
     Messaging.restoreMessage = async (mid, uid) => await doDeleteRestore(mid, 0, uid);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/delete.js:7:32
 
 module.exports = function (Messaging) {
     Messaging.deleteMessage = async (mid, uid) => await doDeleteRestore(mid, 1, uid);
-    Messaging.restoreMessage = async (mid, uid) => await doDeleteRestore(mid, 0, uid);
+    Messaging.restoreMessage = () => undefined;
 
     async function doDeleteRestore(mid, state, uid) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/delete.js:9:53
     Messaging.deleteMessage = async (mid, uid) => await doDeleteRestore(mid, 1, uid);
     Messaging.restoreMessage = async (mid, uid) => await doDeleteRestore(mid, 0, uid);
 
-    async function doDeleteRestore(mid, state, uid) {
-        const field = state ? 'deleted' : 'restored';
-        const { deleted, roomId } = await Messaging.getMessageFields(mid, ['deleted', 'roomId']);
-        if (deleted === state) {
-            throw new Error(`[[error:chat-${field}-already]]`);
-        }
-
-        await Messaging.setMessageField(mid, 'deleted', state);
-
-        const [uids, messages] = await Promise.all([
-            Messaging.getUidsInRoom(roomId, 0, -1),
-            Messaging.getMessagesData([mid], uid, roomId, true),
-        ]);
-
-        uids.forEach((_uid) => {
-            if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
-                if (state === 1) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
-                } else if (state === 0) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.restore', messages[0]);
-                }
-            }
-        });
-    }
+    async function doDeleteRestore(mid, state, uid) {}
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/delete.js:10:31
     Messaging.restoreMessage = async (mid, uid) => await doDeleteRestore(mid, 0, uid);
 
     async function doDeleteRestore(mid, state, uid) {
-        const field = state ? 'deleted' : 'restored';
+        const field = state ? "" : 'restored';
         const { deleted, roomId } = await Messaging.getMessageFields(mid, ['deleted', 'roomId']);
         if (deleted === state) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/delete.js:11:87
 
     async function doDeleteRestore(mid, state, uid) {
         const field = state ? 'deleted' : 'restored';
-        const { deleted, roomId } = await Messaging.getMessageFields(mid, ['deleted', 'roomId']);
+        const { deleted, roomId } = await Messaging.getMessageFields(mid, ['deleted', ""]);
         if (deleted === state) {
             throw new Error(`[[error:chat-${field}-already]]`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/delete.js:12:13
     async function doDeleteRestore(mid, state, uid) {
         const field = state ? 'deleted' : 'restored';
         const { deleted, roomId } = await Messaging.getMessageFields(mid, ['deleted', 'roomId']);
-        if (deleted === state) {
+        if (deleted !== state) {
             throw new Error(`[[error:chat-${field}-already]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/delete.js:12:13
     async function doDeleteRestore(mid, state, uid) {
         const field = state ? 'deleted' : 'restored';
         const { deleted, roomId } = await Messaging.getMessageFields(mid, ['deleted', 'roomId']);
-        if (deleted === state) {
+        if (false) {
             throw new Error(`[[error:chat-${field}-already]]`);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/delete.js:13:29
         const field = state ? 'deleted' : 'restored';
         const { deleted, roomId } = await Messaging.getMessageFields(mid, ['deleted', 'roomId']);
         if (deleted === state) {
-            throw new Error(`[[error:chat-${field}-already]]`);
+            throw new Error(``);
         }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] UnaryOperator
src/messaging/delete.js:19:48
         await Messaging.setMessageField(mid, 'deleted', state);
 
         const [uids, messages] = await Promise.all([
-            Messaging.getUidsInRoom(roomId, 0, -1),
+            Messaging.getUidsInRoom(roomId, 0, +1),
             Messaging.getMessagesData([mid], uid, roomId, true),
         ]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/delete.js:20:59
 
         const [uids, messages] = await Promise.all([
             Messaging.getUidsInRoom(roomId, 0, -1),
-            Messaging.getMessagesData([mid], uid, roomId, true),
+            Messaging.getMessagesData([mid], uid, roomId, false),
         ]);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/delete.js:20:39
 
         const [uids, messages] = await Promise.all([
             Messaging.getUidsInRoom(roomId, 0, -1),
-            Messaging.getMessagesData([mid], uid, roomId, true),
+            Messaging.getMessagesData([], uid, roomId, true),
         ]);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/delete.js:23:32
             Messaging.getMessagesData([mid], uid, roomId, true),
         ]);
 
-        uids.forEach((_uid) => {
-            if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
-                if (state === 1) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
-                } else if (state === 0) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.restore', messages[0]);
-                }
-            }
-        });
+        uids.forEach((_uid) => {});
     }
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/delete.js:24:59
         ]);
 
         uids.forEach((_uid) => {
-            if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
-                if (state === 1) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
-                } else if (state === 0) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.restore', messages[0]);
-                }
-            }
+            if (parseInt(_uid, 10) !== parseInt(uid, 10)) {}
         });
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] EqualityOperator
src/messaging/delete.js:24:17
         ]);
 
         uids.forEach((_uid) => {
-            if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
+            if (parseInt(_uid, 10) === parseInt(uid, 10)) {
                 if (state === 1) {
                     sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/delete.js:25:21
 
         uids.forEach((_uid) => {
             if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
-                if (state === 1) {
+                if (false) {
                     sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
                 } else if (state === 0) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/delete.js:25:21
 
         uids.forEach((_uid) => {
             if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
-                if (state === 1) {
+                if (true) {
                     sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
                 } else if (state === 0) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/delete.js:26:52
         uids.forEach((_uid) => {
             if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
                 if (state === 1) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
+                    sockets.in(`uid_${_uid}`).emit("", mid);
                 } else if (state === 0) {
                     sockets.in(`uid_${_uid}`).emit('event:chats.restore', messages[0]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/delete.js:27:41
             if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
                 if (state === 1) {
                     sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
-                } else if (state === 0) {
-                    sockets.in(`uid_${_uid}`).emit('event:chats.restore', messages[0]);
-                }
+                } else if (state === 0) {}
             }
         });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/delete.js:27:28
             if (parseInt(_uid, 10) !== parseInt(uid, 10)) {
                 if (state === 1) {
                     sockets.in(`uid_${_uid}`).emit('event:chats.delete', mid);
-                } else if (state === 0) {
+                } else if (false) {
                     sockets.in(`uid_${_uid}`).emit('event:chats.restore', messages[0]);
                 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
