[Killed] BlockStatement
src/messaging/rooms.js:12:47
 const meta = require('../meta');
 
 module.exports = function (Messaging) {
-    Messaging.getRoomData = async (roomId) => {
-        const data = await db.getObject(`chat:room:${roomId}`);
-        if (!data) {
-            throw new Error('[[error:no-chat-room]]');
-        }
-
-        modifyRoomData([data]);
-        return data;
-    };
+    Messaging.getRoomData = async (roomId) => {};
 
     Messaging.getRoomsData = async (roomIds) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/rooms.js:14:13
 module.exports = function (Messaging) {
     Messaging.getRoomData = async (roomId) => {
         const data = await db.getObject(`chat:room:${roomId}`);
-        if (!data) {
+        if (data) {
             throw new Error('[[error:no-chat-room]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:14:20
 module.exports = function (Messaging) {
     Messaging.getRoomData = async (roomId) => {
         const data = await db.getObject(`chat:room:${roomId}`);
-        if (!data) {
-            throw new Error('[[error:no-chat-room]]');
-        }
+        if (!data) {}
 
         modifyRoomData([data]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/rooms.js:18:24
             throw new Error('[[error:no-chat-room]]');
         }
 
-        modifyRoomData([data]);
+        modifyRoomData([]);
         return data;
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:22:49
         return data;
     };
 
-    Messaging.getRoomsData = async (roomIds) => {
-        const roomData = await db.getObjects(roomIds.map(roomId => `chat:room:${roomId}`));
-        modifyRoomData(roomData);
-        return roomData;
-    };
+    Messaging.getRoomsData = async (roomIds) => {};
 
     function modifyRoomData(rooms) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:23:58
     };
 
     Messaging.getRoomsData = async (roomIds) => {
-        const roomData = await db.getObjects(roomIds.map(roomId => `chat:room:${roomId}`));
+        const roomData = await db.getObjects(roomIds.map(() => undefined));
         modifyRoomData(roomData);
         return roomData;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:28:36
         return roomData;
     };
 
-    function modifyRoomData(rooms) {
-        rooms.forEach((data) => {
-            if (data) {
-                data.roomName = data.roomName || '';
-                data.roomName = validator.escape(String(data.roomName));
-                if (data.hasOwnProperty('groupChat')) {
-                    data.groupChat = parseInt(data.groupChat, 10) === 1;
-                }
-            }
-        });
-    }
+    function modifyRoomData(rooms) {}
 
     Messaging.newRoom = async (uid, toUids) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:29:33
     };
 
     function modifyRoomData(rooms) {
-        rooms.forEach((data) => {
-            if (data) {
-                data.roomName = data.roomName || '';
-                data.roomName = validator.escape(String(data.roomName));
-                if (data.hasOwnProperty('groupChat')) {
-                    data.groupChat = parseInt(data.groupChat, 10) === 1;
-                }
-            }
-        });
+        rooms.forEach((data) => {});
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/rooms.js:30:23
 
     function modifyRoomData(rooms) {
         rooms.forEach((data) => {
-            if (data) {
-                data.roomName = data.roomName || '';
-                data.roomName = validator.escape(String(data.roomName));
-                if (data.hasOwnProperty('groupChat')) {
-                    data.groupChat = parseInt(data.groupChat, 10) === 1;
-                }
-            }
+            if (data) {}
         });
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:30:17
 
     function modifyRoomData(rooms) {
         rooms.forEach((data) => {
-            if (data) {
+            if (false) {
                 data.roomName = data.roomName || '';
                 data.roomName = validator.escape(String(data.roomName));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:31:33
     function modifyRoomData(rooms) {
         rooms.forEach((data) => {
             if (data) {
-                data.roomName = data.roomName || '';
+                data.roomName = false;
                 data.roomName = validator.escape(String(data.roomName));
                 if (data.hasOwnProperty('groupChat')) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/messaging/rooms.js:31:33
     function modifyRoomData(rooms) {
         rooms.forEach((data) => {
             if (data) {
-                data.roomName = data.roomName || '';
+                data.roomName = data.roomName && '';
                 data.roomName = validator.escape(String(data.roomName));
                 if (data.hasOwnProperty('groupChat')) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:33:55
             if (data) {
                 data.roomName = data.roomName || '';
                 data.roomName = validator.escape(String(data.roomName));
-                if (data.hasOwnProperty('groupChat')) {
-                    data.groupChat = parseInt(data.groupChat, 10) === 1;
-                }
+                if (data.hasOwnProperty('groupChat')) {}
             }
         });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:33:21
             if (data) {
                 data.roomName = data.roomName || '';
                 data.roomName = validator.escape(String(data.roomName));
-                if (data.hasOwnProperty('groupChat')) {
+                if (true) {
                     data.groupChat = parseInt(data.groupChat, 10) === 1;
                 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/rooms.js:34:38
                 data.roomName = data.roomName || '';
                 data.roomName = validator.escape(String(data.roomName));
                 if (data.hasOwnProperty('groupChat')) {
-                    data.groupChat = parseInt(data.groupChat, 10) === 1;
+                    data.groupChat = parseInt(data.groupChat, 10) !== 1;
                 }
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:34:38
                 data.roomName = data.roomName || '';
                 data.roomName = validator.escape(String(data.roomName));
                 if (data.hasOwnProperty('groupChat')) {
-                    data.groupChat = parseInt(data.groupChat, 10) === 1;
+                    data.groupChat = false;
                 }
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:40:48
         });
     }
 
-    Messaging.newRoom = async (uid, toUids) => {
-        const now = Date.now();
-        const roomId = await db.incrObjectField('global', 'nextChatRoomId');
-        const room = {
-            owner: uid,
-            roomId: roomId,
-        };
-
-        await Promise.all([
-            db.setObject(`chat:room:${roomId}`, room),
-            db.sortedSetAdd(`chat:room:${roomId}:uids`, now, uid),
-        ]);
-        await Promise.all([
-            Messaging.addUsersToRoom(uid, toUids, roomId),
-            Messaging.addRoomToUsers(roomId, [uid].concat(toUids), now),
-        ]);
-        // chat owner should also get the user-join system message
-        await Messaging.addSystemMessage('user-join', uid, roomId);
-
-        return roomId;
-    };
+    Messaging.newRoom = async (uid, toUids) => {};
 
     Messaging.isUserInRoom = async (uid, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/rooms.js:48:27
             roomId: roomId,
         };
 
-        await Promise.all([
-            db.setObject(`chat:room:${roomId}`, room),
-            db.sortedSetAdd(`chat:room:${roomId}:uids`, now, uid),
-        ]);
+        await Promise.all([]);
         await Promise.all([
             Messaging.addUsersToRoom(uid, toUids, roomId),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:50:29
 
         await Promise.all([
             db.setObject(`chat:room:${roomId}`, room),
-            db.sortedSetAdd(`chat:room:${roomId}:uids`, now, uid),
+            db.sortedSetAdd(``, now, uid),
         ]);
         await Promise.all([
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:57:42
             Messaging.addRoomToUsers(roomId, [uid].concat(toUids), now),
         ]);
         // chat owner should also get the user-join system message
-        await Messaging.addSystemMessage('user-join', uid, roomId);
+        await Messaging.addSystemMessage("", uid, roomId);
 
         return roomId;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/rooms.js:62:53
         return roomId;
     };
 
-    Messaging.isUserInRoom = async (uid, roomId) => {
-        const inRoom = await db.isSortedSetMember(`chat:room:${roomId}:uids`, uid);
-        const data = await plugins.hooks.fire('filter:messaging.isUserInRoom', { uid: uid, roomId: roomId, inRoom: inRoom });
-        return data.inRoom;
-    };
+    Messaging.isUserInRoom = async (uid, roomId) => {};
 
     Messaging.roomExists = async roomId => db.exists(`chat:room:${roomId}:uids`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/rooms.js:63:51
     };
 
     Messaging.isUserInRoom = async (uid, roomId) => {
-        const inRoom = await db.isSortedSetMember(`chat:room:${roomId}:uids`, uid);
+        const inRoom = await db.isSortedSetMember(``, uid);
         const data = await plugins.hooks.fire('filter:messaging.isUserInRoom', { uid: uid, roomId: roomId, inRoom: inRoom });
         return data.inRoom;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:68:28
         return data.inRoom;
     };
 
-    Messaging.roomExists = async roomId => db.exists(`chat:room:${roomId}:uids`);
+    Messaging.roomExists = () => undefined;
 
     Messaging.getUserCountInRoom = async roomId => db.sortedSetCard(`chat:room:${roomId}:uids`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:70:36
 
     Messaging.roomExists = async roomId => db.exists(`chat:room:${roomId}:uids`);
 
-    Messaging.getUserCountInRoom = async roomId => db.sortedSetCard(`chat:room:${roomId}:uids`);
+    Messaging.getUserCountInRoom = () => undefined;
 
     Messaging.isRoomOwner = async (uids, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:72:53
 
     Messaging.getUserCountInRoom = async roomId => db.sortedSetCard(`chat:room:${roomId}:uids`);
 
-    Messaging.isRoomOwner = async (uids, roomId) => {
-        const isArray = Array.isArray(uids);
-        if (!isArray) {
-            uids = [uids];
-        }
-        const owner = await db.getObjectField(`chat:room:${roomId}`, 'owner');
-        const isOwners = uids.map(uid => parseInt(uid, 10) === parseInt(owner, 10));
-
-        const result = await Promise.all(isOwners.map(async (isOwner, index) => {
-            const payload = await plugins.hooks.fire('filter:messaging.isRoomOwner', { uid: uids[index], roomId, owner, isOwner });
-            return payload.isOwner;
-        }));
-        return isArray ? result : result[0];
-    };
+    Messaging.isRoomOwner = async (uids, roomId) => {};
 
     Messaging.addUsersToRoom = async function (uid, uids, roomId) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:74:13
 
     Messaging.isRoomOwner = async (uids, roomId) => {
         const isArray = Array.isArray(uids);
-        if (!isArray) {
+        if (true) {
             uids = [uids];
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:74:23
 
     Messaging.isRoomOwner = async (uids, roomId) => {
         const isArray = Array.isArray(uids);
-        if (!isArray) {
-            uids = [uids];
-        }
+        if (!isArray) {}
         const owner = await db.getObjectField(`chat:room:${roomId}`, 'owner');
         const isOwners = uids.map(uid => parseInt(uid, 10) === parseInt(owner, 10));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:77:70
         if (!isArray) {
             uids = [uids];
         }
-        const owner = await db.getObjectField(`chat:room:${roomId}`, 'owner');
+        const owner = await db.getObjectField(`chat:room:${roomId}`, "");
         const isOwners = uids.map(uid => parseInt(uid, 10) === parseInt(owner, 10));
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:78:42
             uids = [uids];
         }
         const owner = await db.getObjectField(`chat:room:${roomId}`, 'owner');
-        const isOwners = uids.map(uid => parseInt(uid, 10) === parseInt(owner, 10));
+        const isOwners = uids.map(uid => false);
 
         const result = await Promise.all(isOwners.map(async (isOwner, index) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/rooms.js:78:42
             uids = [uids];
         }
         const owner = await db.getObjectField(`chat:room:${roomId}`, 'owner');
-        const isOwners = uids.map(uid => parseInt(uid, 10) === parseInt(owner, 10));
+        const isOwners = uids.map(uid => parseInt(uid, 10) !== parseInt(owner, 10));
 
         const result = await Promise.all(isOwners.map(async (isOwner, index) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:80:81
         const owner = await db.getObjectField(`chat:room:${roomId}`, 'owner');
         const isOwners = uids.map(uid => parseInt(uid, 10) === parseInt(owner, 10));
 
-        const result = await Promise.all(isOwners.map(async (isOwner, index) => {
-            const payload = await plugins.hooks.fire('filter:messaging.isRoomOwner', { uid: uids[index], roomId, owner, isOwner });
-            return payload.isOwner;
-        }));
+        const result = await Promise.all(isOwners.map(async (isOwner, index) => {}));
         return isArray ? result : result[0];
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:81:54
         const isOwners = uids.map(uid => parseInt(uid, 10) === parseInt(owner, 10));
 
         const result = await Promise.all(isOwners.map(async (isOwner, index) => {
-            const payload = await plugins.hooks.fire('filter:messaging.isRoomOwner', { uid: uids[index], roomId, owner, isOwner });
+            const payload = await plugins.hooks.fire("", { uid: uids[index], roomId, owner, isOwner });
             return payload.isOwner;
         }));
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/rooms.js:87:67
         return isArray ? result : result[0];
     };
 
-    Messaging.addUsersToRoom = async function (uid, uids, roomId) {
-        const inRoom = await Messaging.isUserInRoom(uid, roomId);
-        const payload = await plugins.hooks.fire('filter:messaging.addUsersToRoom', { uid, uids, roomId, inRoom });
-
-        if (!payload.inRoom) {
-            throw new Error('[[error:cant-add-users-to-chat-room]]');
-        }
-
-        const now = Date.now();
-        const timestamps = payload.uids.map(() => now);
-        await db.sortedSetAdd(`chat:room:${payload.roomId}:uids`, timestamps, payload.uids);
-        await updateGroupChatField([payload.roomId]);
-        await Promise.all(payload.uids.map(uid => Messaging.addSystemMessage('user-join', uid, payload.roomId)));
-    };
+    Messaging.addUsersToRoom = async function (uid, uids, roomId) {};
 
     Messaging.removeUsersFromRoom = async (uid, uids, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/rooms.js:91:13
         const inRoom = await Messaging.isUserInRoom(uid, roomId);
         const payload = await plugins.hooks.fire('filter:messaging.addUsersToRoom', { uid, uids, roomId, inRoom });
 
-        if (!payload.inRoom) {
+        if (payload.inRoom) {
             throw new Error('[[error:cant-add-users-to-chat-room]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:91:13
         const inRoom = await Messaging.isUserInRoom(uid, roomId);
         const payload = await plugins.hooks.fire('filter:messaging.addUsersToRoom', { uid, uids, roomId, inRoom });
 
-        if (!payload.inRoom) {
+        if (true) {
             throw new Error('[[error:cant-add-users-to-chat-room]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrowFunction
src/messaging/rooms.js:96:45
         }
 
         const now = Date.now();
-        const timestamps = payload.uids.map(() => now);
+        const timestamps = payload.uids.map(() => undefined);
         await db.sortedSetAdd(`chat:room:${payload.roomId}:uids`, timestamps, payload.uids);
         await updateGroupChatField([payload.roomId]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:99:44
         const timestamps = payload.uids.map(() => now);
         await db.sortedSetAdd(`chat:room:${payload.roomId}:uids`, timestamps, payload.uids);
         await updateGroupChatField([payload.roomId]);
-        await Promise.all(payload.uids.map(uid => Messaging.addSystemMessage('user-join', uid, payload.roomId)));
+        await Promise.all(payload.uids.map(() => undefined));
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:102:66
         await Promise.all(payload.uids.map(uid => Messaging.addSystemMessage('user-join', uid, payload.roomId)));
     };
 
-    Messaging.removeUsersFromRoom = async (uid, uids, roomId) => {
-        const [isOwner, userCount] = await Promise.all([
-            Messaging.isRoomOwner(uid, roomId),
-            Messaging.getUserCountInRoom(roomId),
-        ]);
-        const payload = await plugins.hooks.fire('filter:messaging.removeUsersFromRoom', { uid, uids, roomId, isOwner, userCount });
-
-        if (!payload.isOwner) {
-            throw new Error('[[error:cant-remove-users-from-chat-room]]');
-        }
-
-        await Messaging.leaveRoom(payload.uids, payload.roomId);
-    };
+    Messaging.removeUsersFromRoom = async (uid, uids, roomId) => {};
 
     Messaging.isGroupChat = async function (roomId) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:109:31
         ]);
         const payload = await plugins.hooks.fire('filter:messaging.removeUsersFromRoom', { uid, uids, roomId, isOwner, userCount });
 
-        if (!payload.isOwner) {
-            throw new Error('[[error:cant-remove-users-from-chat-room]]');
-        }
+        if (!payload.isOwner) {}
 
         await Messaging.leaveRoom(payload.uids, payload.roomId);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/rooms.js:109:13
         ]);
         const payload = await plugins.hooks.fire('filter:messaging.removeUsersFromRoom', { uid, uids, roomId, isOwner, userCount });
 
-        if (!payload.isOwner) {
+        if (payload.isOwner) {
             throw new Error('[[error:cant-remove-users-from-chat-room]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/rooms.js:116:53
         await Messaging.leaveRoom(payload.uids, payload.roomId);
     };
 
-    Messaging.isGroupChat = async function (roomId) {
-        return (await Messaging.getRoomData(roomId)).groupChat;
-    };
+    Messaging.isGroupChat = async function (roomId) {};
 
     async function updateGroupChatField(roomIds) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:120:50
         return (await Messaging.getRoomData(roomId)).groupChat;
     };
 
-    async function updateGroupChatField(roomIds) {
-        const userCounts = await db.sortedSetsCard(roomIds.map(roomId => `chat:room:${roomId}:uids`));
-        const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
-        const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
-        await db.setObjectBulk([
-            ...groupChats.map(id => [`chat:room:${id}`, { groupChat: 1 }]),
-            ...privateChats.map(id => [`chat:room:${id}`, { groupChat: 0 }]),
-        ]);
-    }
+    async function updateGroupChatField(roomIds) {}
 
     Messaging.leaveRoom = async (uids, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrowFunction
src/messaging/rooms.js:121:64
     };
 
     async function updateGroupChatField(roomIds) {
-        const userCounts = await db.sortedSetsCard(roomIds.map(roomId => `chat:room:${roomId}:uids`));
+        const userCounts = await db.sortedSetsCard(roomIds.map(() => undefined));
         const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
         const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:121:74
     };
 
     async function updateGroupChatField(roomIds) {
-        const userCounts = await db.sortedSetsCard(roomIds.map(roomId => `chat:room:${roomId}:uids`));
+        const userCounts = await db.sortedSetsCard(roomIds.map(roomId => ``));
         const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
         const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:122:62
 
     async function updateGroupChatField(roomIds) {
         const userCounts = await db.sortedSetsCard(roomIds.map(roomId => `chat:room:${roomId}:uids`));
-        const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
+        const groupChats = roomIds.filter((roomId, index) => true);
         const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
         await db.setObjectBulk([
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
