[Killed] UnaryOperator
src/messaging/notifications.js:15:61
     Messaging.notifyQueue = {}; // Only used to notify a user of a new chat message, see Messaging.notifyUser
 
     Messaging.notifyUsersInRoom = async (fromUid, roomId, messageObj) => {
-        let uids = await Messaging.getUidsInRoom(roomId, 0, -1);
+        let uids = await Messaging.getUidsInRoom(roomId, 0, +1);
         uids = await user.blocks.filterUids(fromUid, uids);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/notifications.js:25:13
             uids: uids,
         };
         data = await plugins.hooks.fire('filter:messaging.notify', data);
-        if (!data || !data.uids || !data.uids.length) {
+        if (data || !data.uids || !data.uids.length) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/notifications.js:25:22
             uids: uids,
         };
         data = await plugins.hooks.fire('filter:messaging.notify', data);
-        if (!data || !data.uids || !data.uids.length) {
+        if (!data || data.uids || !data.uids.length) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/notifications.js:30:31
         }
 
         uids = data.uids;
-        uids.forEach((uid) => {
-            data.self = parseInt(uid, 10) === parseInt(fromUid, 10) ? 1 : 0;
-            Messaging.pushUnreadCount(uid);
-            sockets.in(`uid_${uid}`).emit('event:chats.receive', data);
-        });
+        uids.forEach((uid) => {});
         if (messageObj.system) {
             return;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/notifications.js:31:25
 
         uids = data.uids;
         uids.forEach((uid) => {
-            data.self = parseInt(uid, 10) === parseInt(fromUid, 10) ? 1 : 0;
+            data.self = false ? 1 : 0;
             Messaging.pushUnreadCount(uid);
             sockets.in(`uid_${uid}`).emit('event:chats.receive', data);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/notifications.js:31:25
 
         uids = data.uids;
         uids.forEach((uid) => {
-            data.self = parseInt(uid, 10) === parseInt(fromUid, 10) ? 1 : 0;
+            data.self = parseInt(uid, 10) !== parseInt(fromUid, 10) ? 1 : 0;
             Messaging.pushUnreadCount(uid);
             sockets.in(`uid_${uid}`).emit('event:chats.receive', data);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/notifications.js:33:24
         uids.forEach((uid) => {
             data.self = parseInt(uid, 10) === parseInt(fromUid, 10) ? 1 : 0;
             Messaging.pushUnreadCount(uid);
-            sockets.in(`uid_${uid}`).emit('event:chats.receive', data);
+            sockets.in(``).emit('event:chats.receive', data);
         });
         if (messageObj.system) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/notifications.js:33:43
         uids.forEach((uid) => {
             data.self = parseInt(uid, 10) === parseInt(fromUid, 10) ? 1 : 0;
             Messaging.pushUnreadCount(uid);
-            sockets.in(`uid_${uid}`).emit('event:chats.receive', data);
+            sockets.in(`uid_${uid}`).emit("", data);
         });
         if (messageObj.system) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/notifications.js:35:13
             Messaging.pushUnreadCount(uid);
             sockets.in(`uid_${uid}`).emit('event:chats.receive', data);
         });
-        if (messageObj.system) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/notifications.js:35:32
             Messaging.pushUnreadCount(uid);
             sockets.in(`uid_${uid}`).emit('event:chats.receive', data);
         });
-        if (messageObj.system) {
-            return;
-        }
+        if (messageObj.system) {}
         // Delayed notifications
         let queueObj = Messaging.notifyQueue[`${fromUid}:${roomId}`];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/notifications.js:39:46
             return;
         }
         // Delayed notifications
-        let queueObj = Messaging.notifyQueue[`${fromUid}:${roomId}`];
+        let queueObj = Messaging.notifyQueue[``];
         if (queueObj) {
             queueObj.message.content += `\n${messageObj.content}`;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/notifications.js:40:13
         }
         // Delayed notifications
         let queueObj = Messaging.notifyQueue[`${fromUid}:${roomId}`];
-        if (queueObj) {
+        if (false) {
             queueObj.message.content += `\n${messageObj.content}`;
             clearTimeout(queueObj.timeout);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/notifications.js:40:13
         }
         // Delayed notifications
         let queueObj = Messaging.notifyQueue[`${fromUid}:${roomId}`];
-        if (queueObj) {
+        if (true) {
             queueObj.message.content += `\n${messageObj.content}`;
             clearTimeout(queueObj.timeout);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/notifications.js:43:16
         if (queueObj) {
             queueObj.message.content += `\n${messageObj.content}`;
             clearTimeout(queueObj.timeout);
-        } else {
-            queueObj = {
-                message: messageObj,
-            };
-            Messaging.notifyQueue[`${fromUid}:${roomId}`] = queueObj;
-        }
+        } else {}
 
         queueObj.timeout = setTimeout(async () => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/notifications.js:50:51
             Messaging.notifyQueue[`${fromUid}:${roomId}`] = queueObj;
         }
 
-        queueObj.timeout = setTimeout(async () => {
-            try {
-                await sendNotifications(fromUid, uids, roomId, queueObj.message);
-            } catch (err) {
-                winston.error(`[messaging/notifications] Unabled to send notification\n${err.stack}`);
-            }
-        }, meta.config.notificationSendDelay * 1000);
+        queueObj.timeout = setTimeout(async () => {}, meta.config.notificationSendDelay * 1000);
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/notifications.js:51:17
         }
 
         queueObj.timeout = setTimeout(async () => {
-            try {
-                await sendNotifications(fromUid, uids, roomId, queueObj.message);
-            } catch (err) {
+            try {} catch (err) {
                 winston.error(`[messaging/notifications] Unabled to send notification\n${err.stack}`);
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/notifications.js:53:27
         queueObj.timeout = setTimeout(async () => {
             try {
                 await sendNotifications(fromUid, uids, roomId, queueObj.message);
-            } catch (err) {
-                winston.error(`[messaging/notifications] Unabled to send notification\n${err.stack}`);
-            }
+            } catch (err) {}
         }, meta.config.notificationSendDelay * 1000);
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArithmeticOperator
src/messaging/notifications.js:56:12
             } catch (err) {
                 winston.error(`[messaging/notifications] Unabled to send notification\n${err.stack}`);
             }
-        }, meta.config.notificationSendDelay * 1000);
+        }, meta.config.notificationSendDelay / 1000);
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/notifications.js:59:73
         }, meta.config.notificationSendDelay * 1000);
     };
 
-    async function sendNotifications(fromuid, uids, roomId, messageObj) {
-        const isOnline = await user.isOnline(uids);
-        uids = uids.filter((uid, index) => !isOnline[index] && parseInt(fromuid, 10) !== parseInt(uid, 10));
-        if (!uids.length) {
-            return;
-        }
-
-        const { displayname } = messageObj.fromUser;
-
-        const isGroupChat = await Messaging.isGroupChat(roomId);
-        const notification = await notifications.create({
-            type: isGroupChat ? 'new-group-chat' : 'new-chat',
-            subject: `[[email:notif.chat.subject, ${displayname}]]`,
-            bodyShort: `[[notifications:new_message_from, ${displayname}]]`,
-            bodyLong: messageObj.content,
-            nid: `chat_${fromuid}_${roomId}`,
-            from: fromuid,
-            path: `/chats/${messageObj.roomId}`,
-        });
-
-        delete Messaging.notifyQueue[`${fromuid}:${roomId}`];
-        notifications.push(notification, uids);
-    }
+    async function sendNotifications(fromuid, uids, roomId, messageObj) {}
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/notifications.js:61:44
 
     async function sendNotifications(fromuid, uids, roomId, messageObj) {
         const isOnline = await user.isOnline(uids);
-        uids = uids.filter((uid, index) => !isOnline[index] && parseInt(fromuid, 10) !== parseInt(uid, 10));
+        uids = uids.filter((uid, index) => true);
         if (!uids.length) {
             return;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/notifications.js:61:44
 
     async function sendNotifications(fromuid, uids, roomId, messageObj) {
         const isOnline = await user.isOnline(uids);
-        uids = uids.filter((uid, index) => !isOnline[index] && parseInt(fromuid, 10) !== parseInt(uid, 10));
+        uids = uids.filter((uid, index) => isOnline[index] && parseInt(fromuid, 10) !== parseInt(uid, 10));
         if (!uids.length) {
             return;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/notifications.js:62:13
     async function sendNotifications(fromuid, uids, roomId, messageObj) {
         const isOnline = await user.isOnline(uids);
         uids = uids.filter((uid, index) => !isOnline[index] && parseInt(fromuid, 10) !== parseInt(uid, 10));
-        if (!uids.length) {
+        if (uids.length) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/notifications.js:62:27
     async function sendNotifications(fromuid, uids, roomId, messageObj) {
         const isOnline = await user.isOnline(uids);
         uids = uids.filter((uid, index) => !isOnline[index] && parseInt(fromuid, 10) !== parseInt(uid, 10));
-        if (!uids.length) {
-            return;
-        }
+        if (!uids.length) {}
 
         const { displayname } = messageObj.fromUser;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/notifications.js:70:33
 
         const isGroupChat = await Messaging.isGroupChat(roomId);
         const notification = await notifications.create({
-            type: isGroupChat ? 'new-group-chat' : 'new-chat',
+            type: isGroupChat ? "" : 'new-chat',
             subject: `[[email:notif.chat.subject, ${displayname}]]`,
             bodyShort: `[[notifications:new_message_from, ${displayname}]]`,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/notifications.js:76:19
             bodyLong: messageObj.content,
             nid: `chat_${fromuid}_${roomId}`,
             from: fromuid,
-            path: `/chats/${messageObj.roomId}`,
+            path: ``,
         });
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
