[Killed] MethodExpression
src/messaging/rooms.js:122:28
 
     async function updateGroupChatField(roomIds) {
         const userCounts = await db.sortedSetsCard(roomIds.map(roomId => `chat:room:${roomId}:uids`));
-        const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
+        const groupChats = roomIds;
         const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
         await db.setObjectBulk([
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:123:45
     async function updateGroupChatField(roomIds) {
         const userCounts = await db.sortedSetsCard(roomIds.map(roomId => `chat:room:${roomId}:uids`));
         const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
-        const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
+        const privateChats = roomIds.filter(() => undefined);
         await db.setObjectBulk([
             ...groupChats.map(id => [`chat:room:${id}`, { groupChat: 1 }]),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/rooms.js:123:64
     async function updateGroupChatField(roomIds) {
         const userCounts = await db.sortedSetsCard(roomIds.map(roomId => `chat:room:${roomId}:uids`));
         const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
-        const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
+        const privateChats = roomIds.filter((roomId, index) => true);
         await db.setObjectBulk([
             ...groupChats.map(id => [`chat:room:${id}`, { groupChat: 1 }]),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:125:31
         const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
         const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
         await db.setObjectBulk([
-            ...groupChats.map(id => [`chat:room:${id}`, { groupChat: 1 }]),
+            ...groupChats.map(() => undefined),
             ...privateChats.map(id => [`chat:room:${id}`, { groupChat: 0 }]),
         ]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrayDeclaration
src/messaging/rooms.js:125:37
         const groupChats = roomIds.filter((roomId, index) => userCounts[index] > 2);
         const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
         await db.setObjectBulk([
-            ...groupChats.map(id => [`chat:room:${id}`, { groupChat: 1 }]),
+            ...groupChats.map(id => []),
             ...privateChats.map(id => [`chat:room:${id}`, { groupChat: 0 }]),
         ]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:126:33
         const privateChats = roomIds.filter((roomId, index) => userCounts[index] <= 2);
         await db.setObjectBulk([
             ...groupChats.map(id => [`chat:room:${id}`, { groupChat: 1 }]),
-            ...privateChats.map(id => [`chat:room:${id}`, { groupChat: 0 }]),
+            ...privateChats.map(() => undefined),
         ]);
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:130:51
         ]);
     }
 
-    Messaging.leaveRoom = async (uids, roomId) => {
-        const isInRoom = await Promise.all(uids.map(uid => Messaging.isUserInRoom(uid, roomId)));
-        uids = uids.filter((uid, index) => isInRoom[index]);
-
-        const keys = uids
-            .map(uid => `uid:${uid}:chat:rooms`)
-            .concat(uids.map(uid => `uid:${uid}:chat:rooms:unread`));
-
-        await Promise.all([
-            db.sortedSetRemove(`chat:room:${roomId}:uids`, uids),
-            db.sortedSetsRemove(keys, roomId),
-        ]);
-
-        await Promise.all(uids.map(uid => Messaging.addSystemMessage('user-leave', uid, roomId)));
-        await updateOwner(roomId);
-        await updateGroupChatField([roomId]);
-    };
+    Messaging.leaveRoom = async (uids, roomId) => {};
 
     Messaging.leaveRooms = async (uid, roomIds) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:131:53
     }
 
     Messaging.leaveRoom = async (uids, roomId) => {
-        const isInRoom = await Promise.all(uids.map(uid => Messaging.isUserInRoom(uid, roomId)));
+        const isInRoom = await Promise.all(uids.map(() => undefined));
         uids = uids.filter((uid, index) => isInRoom[index]);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] MethodExpression
src/messaging/rooms.js:132:16
 
     Messaging.leaveRoom = async (uids, roomId) => {
         const isInRoom = await Promise.all(uids.map(uid => Messaging.isUserInRoom(uid, roomId)));
-        uids = uids.filter((uid, index) => isInRoom[index]);
+        uids = uids;
 
         const keys = uids
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:132:28
 
     Messaging.leaveRoom = async (uids, roomId) => {
         const isInRoom = await Promise.all(uids.map(uid => Messaging.isUserInRoom(uid, roomId)));
-        uids = uids.filter((uid, index) => isInRoom[index]);
+        uids = uids.filter(() => undefined);
 
         const keys = uids
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:135:18
         uids = uids.filter((uid, index) => isInRoom[index]);
 
         const keys = uids
-            .map(uid => `uid:${uid}:chat:rooms`)
+            .map(() => undefined)
             .concat(uids.map(uid => `uid:${uid}:chat:rooms:unread`));
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:136:30
 
         const keys = uids
             .map(uid => `uid:${uid}:chat:rooms`)
-            .concat(uids.map(uid => `uid:${uid}:chat:rooms:unread`));
+            .concat(uids.map(() => undefined));
 
         await Promise.all([
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrowFunction
src/messaging/rooms.js:143:36
             db.sortedSetsRemove(keys, roomId),
         ]);
 
-        await Promise.all(uids.map(uid => Messaging.addSystemMessage('user-leave', uid, roomId)));
+        await Promise.all(uids.map(() => undefined));
         await updateOwner(roomId);
         await updateGroupChatField([roomId]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:148:52
         await updateGroupChatField([roomId]);
     };
 
-    Messaging.leaveRooms = async (uid, roomIds) => {
-        const isInRoom = await Promise.all(roomIds.map(roomId => Messaging.isUserInRoom(uid, roomId)));
-        roomIds = roomIds.filter((roomId, index) => isInRoom[index]);
-
-        const roomKeys = roomIds.map(roomId => `chat:room:${roomId}:uids`);
-        await Promise.all([
-            db.sortedSetsRemove(roomKeys, uid),
-            db.sortedSetRemove([
-                `uid:${uid}:chat:rooms`,
-                `uid:${uid}:chat:rooms:unread`,
-            ], roomIds),
-        ]);
-
-        await Promise.all(
-            roomIds.map(roomId => updateOwner(roomId))
-                .concat(roomIds.map(roomId => Messaging.addSystemMessage('user-leave', uid, roomId)))
-        );
-        await updateGroupChatField(roomIds);
-    };
+    Messaging.leaveRooms = async (uid, roomIds) => {};
 
     async function updateOwner(roomId) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:149:56
     };
 
     Messaging.leaveRooms = async (uid, roomIds) => {
-        const isInRoom = await Promise.all(roomIds.map(roomId => Messaging.isUserInRoom(uid, roomId)));
+        const isInRoom = await Promise.all(roomIds.map(() => undefined));
         roomIds = roomIds.filter((roomId, index) => isInRoom[index]);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] MethodExpression
src/messaging/rooms.js:150:19
 
     Messaging.leaveRooms = async (uid, roomIds) => {
         const isInRoom = await Promise.all(roomIds.map(roomId => Messaging.isUserInRoom(uid, roomId)));
-        roomIds = roomIds.filter((roomId, index) => isInRoom[index]);
+        roomIds = roomIds;
 
         const roomKeys = roomIds.map(roomId => `chat:room:${roomId}:uids`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:150:34
 
     Messaging.leaveRooms = async (uid, roomIds) => {
         const isInRoom = await Promise.all(roomIds.map(roomId => Messaging.isUserInRoom(uid, roomId)));
-        roomIds = roomIds.filter((roomId, index) => isInRoom[index]);
+        roomIds = roomIds.filter(() => undefined);
 
         const roomKeys = roomIds.map(roomId => `chat:room:${roomId}:uids`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:152:38
         const isInRoom = await Promise.all(roomIds.map(roomId => Messaging.isUserInRoom(uid, roomId)));
         roomIds = roomIds.filter((roomId, index) => isInRoom[index]);
 
-        const roomKeys = roomIds.map(roomId => `chat:room:${roomId}:uids`);
+        const roomKeys = roomIds.map(() => undefined);
         await Promise.all([
             db.sortedSetsRemove(roomKeys, uid),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:152:48
         const isInRoom = await Promise.all(roomIds.map(roomId => Messaging.isUserInRoom(uid, roomId)));
         roomIds = roomIds.filter((roomId, index) => isInRoom[index]);
 
-        const roomKeys = roomIds.map(roomId => `chat:room:${roomId}:uids`);
+        const roomKeys = roomIds.map(roomId => ``);
         await Promise.all([
             db.sortedSetsRemove(roomKeys, uid),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ArrayDeclaration
src/messaging/rooms.js:153:27
         roomIds = roomIds.filter((roomId, index) => isInRoom[index]);
 
         const roomKeys = roomIds.map(roomId => `chat:room:${roomId}:uids`);
-        await Promise.all([
-            db.sortedSetsRemove(roomKeys, uid),
-            db.sortedSetRemove([
-                `uid:${uid}:chat:rooms`,
-                `uid:${uid}:chat:rooms:unread`,
-            ], roomIds),
-        ]);
+        await Promise.all([]);
 
         await Promise.all(
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:162:25
         ]);
 
         await Promise.all(
-            roomIds.map(roomId => updateOwner(roomId))
+            roomIds.map(() => undefined)
                 .concat(roomIds.map(roomId => Messaging.addSystemMessage('user-leave', uid, roomId)))
         );
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:163:37
 
         await Promise.all(
             roomIds.map(roomId => updateOwner(roomId))
-                .concat(roomIds.map(roomId => Messaging.addSystemMessage('user-leave', uid, roomId)))
+                .concat(roomIds.map(() => undefined))
         );
         await updateGroupChatField(roomIds);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:168:40
         await updateGroupChatField(roomIds);
     };
 
-    async function updateOwner(roomId) {
-        const uids = await db.getSortedSetRange(`chat:room:${roomId}:uids`, 0, 0);
-        const newOwner = uids[0] || 0;
-        await db.setObjectField(`chat:room:${roomId}`, 'owner', newOwner);
-    }
+    async function updateOwner(roomId) {}
 
     Messaging.getUidsInRoom = async (roomId, start, stop) => db.getSortedSetRevRange(`chat:room:${roomId}:uids`, start, stop);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:169:49
     };
 
     async function updateOwner(roomId) {
-        const uids = await db.getSortedSetRange(`chat:room:${roomId}:uids`, 0, 0);
+        const uids = await db.getSortedSetRange(``, 0, 0);
         const newOwner = uids[0] || 0;
         await db.setObjectField(`chat:room:${roomId}`, 'owner', newOwner);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:170:26
 
     async function updateOwner(roomId) {
         const uids = await db.getSortedSetRange(`chat:room:${roomId}:uids`, 0, 0);
-        const newOwner = uids[0] || 0;
+        const newOwner = true;
         await db.setObjectField(`chat:room:${roomId}`, 'owner', newOwner);
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] LogicalOperator
src/messaging/rooms.js:170:26
 
     async function updateOwner(roomId) {
         const uids = await db.getSortedSetRange(`chat:room:${roomId}:uids`, 0, 0);
-        const newOwner = uids[0] || 0;
+        const newOwner = uids[0] && 0;
         await db.setObjectField(`chat:room:${roomId}`, 'owner', newOwner);
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:171:33
     async function updateOwner(roomId) {
         const uids = await db.getSortedSetRange(`chat:room:${roomId}:uids`, 0, 0);
         const newOwner = uids[0] || 0;
-        await db.setObjectField(`chat:room:${roomId}`, 'owner', newOwner);
+        await db.setObjectField(``, 'owner', newOwner);
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/rooms.js:174:31
         await db.setObjectField(`chat:room:${roomId}`, 'owner', newOwner);
     }
 
-    Messaging.getUidsInRoom = async (roomId, start, stop) => db.getSortedSetRevRange(`chat:room:${roomId}:uids`, start, stop);
+    Messaging.getUidsInRoom = () => undefined;
 
     Messaging.getUsersInRoom = async (roomId, start, stop) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:174:86
         await db.setObjectField(`chat:room:${roomId}`, 'owner', newOwner);
     }
 
-    Messaging.getUidsInRoom = async (roomId, start, stop) => db.getSortedSetRevRange(`chat:room:${roomId}:uids`, start, stop);
+    Messaging.getUidsInRoom = async (roomId, start, stop) => db.getSortedSetRevRange(``, start, stop);
 
     Messaging.getUsersInRoom = async (roomId, start, stop) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:176:63
 
     Messaging.getUidsInRoom = async (roomId, start, stop) => db.getSortedSetRevRange(`chat:room:${roomId}:uids`, start, stop);
 
-    Messaging.getUsersInRoom = async (roomId, start, stop) => {
-        const uids = await Messaging.getUidsInRoom(roomId, start, stop);
-        const [users, isOwners] = await Promise.all([
-            user.getUsersFields(uids, ['uid', 'username', 'picture', 'status']),
-            Messaging.isRoomOwner(uids, roomId),
-        ]);
-
-        return users.map((user, index) => {
-            user.isOwner = isOwners[index];
-            return user;
-        });
-    };
+    Messaging.getUsersInRoom = async (roomId, start, stop) => {};
 
     Messaging.renameRoom = async function (uid, roomId, newName) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:179:40
     Messaging.getUsersInRoom = async (roomId, start, stop) => {
         const uids = await Messaging.getUidsInRoom(roomId, start, stop);
         const [users, isOwners] = await Promise.all([
-            user.getUsersFields(uids, ['uid', 'username', 'picture', 'status']),
+            user.getUsersFields(uids, ["", 'username', 'picture', 'status']),
             Messaging.isRoomOwner(uids, roomId),
         ]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:183:43
             Messaging.isRoomOwner(uids, roomId),
         ]);
 
-        return users.map((user, index) => {
-            user.isOwner = isOwners[index];
-            return user;
-        });
+        return users.map((user, index) => {});
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:190:13
     };
 
     Messaging.renameRoom = async function (uid, roomId, newName) {
-        if (!newName) {
+        if (false) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:190:23
     };
 
     Messaging.renameRoom = async function (uid, roomId, newName) {
-        if (!newName) {
-            throw new Error('[[error:invalid-data]]');
-        }
+        if (!newName) {}
         newName = newName.trim();
         if (newName.length > 75) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] MethodExpression
src/messaging/rooms.js:193:19
         if (!newName) {
             throw new Error('[[error:invalid-data]]');
         }
-        newName = newName.trim();
+        newName = newName;
         if (newName.length > 75) {
             throw new Error('[[error:chat-room-name-too-long]]');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] EqualityOperator
src/messaging/rooms.js:194:13
             throw new Error('[[error:invalid-data]]');
         }
         newName = newName.trim();
-        if (newName.length > 75) {
+        if (newName.length >= 75) {
             throw new Error('[[error:chat-room-name-too-long]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/rooms.js:194:13
             throw new Error('[[error:invalid-data]]');
         }
         newName = newName.trim();
-        if (newName.length > 75) {
+        if (newName.length <= 75) {
             throw new Error('[[error:chat-room-name-too-long]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/messaging/rooms.js:198:76
             throw new Error('[[error:chat-room-name-too-long]]');
         }
 
-        const payload = await plugins.hooks.fire('filter:chat.renameRoom', {
-            uid: uid,
-            roomId: roomId,
-            newName: newName,
-        });
+        const payload = await plugins.hooks.fire('filter:chat.renameRoom', {});
         const isOwner = await Messaging.isRoomOwner(payload.uid, payload.roomId);
         if (!isOwner) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/rooms.js:204:13
             newName: newName,
         });
         const isOwner = await Messaging.isRoomOwner(payload.uid, payload.roomId);
-        if (!isOwner) {
+        if (isOwner) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] ConditionalExpression
src/messaging/rooms.js:204:13
             newName: newName,
         });
         const isOwner = await Messaging.isRoomOwner(payload.uid, payload.roomId);
-        if (!isOwner) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:208:33
             throw new Error('[[error:no-privileges]]');
         }
 
-        await db.setObjectField(`chat:room:${payload.roomId}`, 'roomName', payload.newName);
+        await db.setObjectField(``, 'roomName', payload.newName);
         await Messaging.addSystemMessage(`room-rename, ${payload.newName.replace(',', '&#44;')}`, payload.uid, payload.roomId);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] StringLiteral
src/messaging/rooms.js:208:64
             throw new Error('[[error:no-privileges]]');
         }
 
-        await db.setObjectField(`chat:room:${payload.roomId}`, 'roomName', payload.newName);
+        await db.setObjectField(`chat:room:${payload.roomId}`, "", payload.newName);
         await Messaging.addSystemMessage(`room-rename, ${payload.newName.replace(',', '&#44;')}`, payload.uid, payload.roomId);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:209:87
         }
 
         await db.setObjectField(`chat:room:${payload.roomId}`, 'roomName', payload.newName);
-        await Messaging.addSystemMessage(`room-rename, ${payload.newName.replace(',', '&#44;')}`, payload.uid, payload.roomId);
+        await Messaging.addSystemMessage(`room-rename, ${payload.newName.replace(',', "")}`, payload.uid, payload.roomId);
 
         plugins.hooks.fire('action:chat.renameRoom', {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/rooms.js:217:49
         });
     };
 
-    Messaging.canReply = async (roomId, uid) => {
-        const inRoom = await db.isSortedSetMember(`chat:room:${roomId}:uids`, uid);
-        const data = await plugins.hooks.fire('filter:messaging.canReply', { uid: uid, roomId: roomId, inRoom: inRoom, canReply: inRoom });
-        return data.canReply;
-    };
+    Messaging.canReply = async (roomId, uid) => {};
 
     Messaging.loadRoom = async (uid, data) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:225:13
 
     Messaging.loadRoom = async (uid, data) => {
         const canChat = await privileges.global.can('chat', uid);
-        if (!canChat) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/rooms.js:229:22
             throw new Error('[[error:no-privileges]]');
         }
         const inRoom = await Messaging.isUserInRoom(uid, data.roomId);
-        if (!inRoom) {
-            return null;
-        }
+        if (!inRoom) {}
 
         const [room, canReply, users, messages, isAdminOrGlobalMod] = await Promise.all([
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:229:13
             throw new Error('[[error:no-privileges]]');
         }
         const inRoom = await Messaging.isUserInRoom(uid, data.roomId);
-        if (!inRoom) {
+        if (false) {
             return null;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/messaging/rooms.js:233:89
             return null;
         }
 
-        const [room, canReply, users, messages, isAdminOrGlobalMod] = await Promise.all([
-            Messaging.getRoomData(data.roomId),
-            Messaging.canReply(data.roomId, uid),
-            Messaging.getUsersInRoom(data.roomId, 0, -1),
-            Messaging.getMessages({
-                callerUid: uid,
-                uid: data.uid || uid,
-                roomId: data.roomId,
-                isNew: false,
-            }),
-            user.isAdminOrGlobalMod(uid),
-        ]);
+        const [room, canReply, users, messages, isAdminOrGlobalMod] = await Promise.all([]);
 
         room.messages = messages;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
