[Killed] BlockStatement
src/messaging/unread.js:7:47
 const sockets = require('../socket.io');
 
 module.exports = function (Messaging) {
-    Messaging.getUnreadCount = async (uid) => {
-        if (parseInt(uid, 10) <= 0) {
-            return 0;
-        }
-
-        return await db.sortedSetCard(`uid:${uid}:chat:rooms:unread`);
-    };
+    Messaging.getUnreadCount = async (uid) => {};
 
     Messaging.pushUnreadCount = async (uid) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/unread.js:8:37
 
 module.exports = function (Messaging) {
     Messaging.getUnreadCount = async (uid) => {
-        if (parseInt(uid, 10) <= 0) {
-            return 0;
-        }
+        if (parseInt(uid, 10) <= 0) {}
 
         return await db.sortedSetCard(`uid:${uid}:chat:rooms:unread`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/unread.js:8:13
 
 module.exports = function (Messaging) {
     Messaging.getUnreadCount = async (uid) => {
-        if (parseInt(uid, 10) <= 0) {
+        if (true) {
             return 0;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/unread.js:12:39
             return 0;
         }
 
-        return await db.sortedSetCard(`uid:${uid}:chat:rooms:unread`);
+        return await db.sortedSetCard(``);
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/unread.js:15:48
         return await db.sortedSetCard(`uid:${uid}:chat:rooms:unread`);
     };
 
-    Messaging.pushUnreadCount = async (uid) => {
-        if (parseInt(uid, 10) <= 0) {
-            return;
-        }
-        const unreadCount = await Messaging.getUnreadCount(uid);
-        sockets.in(`uid_${uid}`).emit('event:unread.updateChatCount', unreadCount);
-    };
+    Messaging.pushUnreadCount = async (uid) => {};
 
     Messaging.markRead = async (uid, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/unread.js:16:13
     };
 
     Messaging.pushUnreadCount = async (uid) => {
-        if (parseInt(uid, 10) <= 0) {
+        if (true) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/unread.js:16:13
     };
 
     Messaging.pushUnreadCount = async (uid) => {
-        if (parseInt(uid, 10) <= 0) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/unread.js:23:49
         sockets.in(`uid_${uid}`).emit('event:unread.updateChatCount', unreadCount);
     };
 
-    Messaging.markRead = async (uid, roomId) => {
-        await db.sortedSetRemove(`uid:${uid}:chat:rooms:unread`, roomId);
-    };
+    Messaging.markRead = async (uid, roomId) => {};
 
     Messaging.markAllRead = async (uid) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/unread.js:27:44
         await db.sortedSetRemove(`uid:${uid}:chat:rooms:unread`, roomId);
     };
 
-    Messaging.markAllRead = async (uid) => {
-        await db.delete(`uid:${uid}:chat:rooms:unread`);
-    };
+    Messaging.markAllRead = async (uid) => {};
 
     Messaging.markUnread = async (uids, roomId) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/unread.js:28:25
     };
 
     Messaging.markAllRead = async (uid) => {
-        await db.delete(`uid:${uid}:chat:rooms:unread`);
+        await db.delete(``);
     };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/messaging/unread.js:31:52
         await db.delete(`uid:${uid}:chat:rooms:unread`);
     };
 
-    Messaging.markUnread = async (uids, roomId) => {
-        const exists = await Messaging.roomExists(roomId);
-        if (!exists) {
-            return;
-        }
-        const keys = uids.map(uid => `uid:${uid}:chat:rooms:unread`);
-        return await db.sortedSetsAdd(keys, Date.now(), roomId);
-    };
+    Messaging.markUnread = async (uids, roomId) => {};
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/unread.js:33:13
 
     Messaging.markUnread = async (uids, roomId) => {
         const exists = await Messaging.roomExists(roomId);
-        if (!exists) {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] BlockStatement
src/messaging/unread.js:33:22
 
     Messaging.markUnread = async (uids, roomId) => {
         const exists = await Messaging.roomExists(roomId);
-        if (!exists) {
-            return;
-        }
+        if (!exists) {}
         const keys = uids.map(uid => `uid:${uid}:chat:rooms:unread`);
         return await db.sortedSetsAdd(keys, Date.now(), roomId);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/messaging/unread.js:36:31
         if (!exists) {
             return;
         }
-        const keys = uids.map(uid => `uid:${uid}:chat:rooms:unread`);
+        const keys = uids.map(() => undefined);
         return await db.sortedSetsAdd(keys, Date.now(), roomId);
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/unread.js:36:38
         if (!exists) {
             return;
         }
-        const keys = uids.map(uid => `uid:${uid}:chat:rooms:unread`);
+        const keys = uids.map(uid => ``);
         return await db.sortedSetsAdd(keys, Date.now(), roomId);
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
