[Killed] UnaryOperator
src/messaging/rooms.js:236:54
         const [room, canReply, users, messages, isAdminOrGlobalMod] = await Promise.all([
             Messaging.getRoomData(data.roomId),
             Messaging.canReply(data.roomId, uid),
-            Messaging.getUsersInRoom(data.roomId, 0, -1),
+            Messaging.getUsersInRoom(data.roomId, 0, +1),
             Messaging.getMessages({
                 callerUid: uid,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:239:22
             Messaging.getUsersInRoom(data.roomId, 0, -1),
             Messaging.getMessages({
                 callerUid: uid,
-                uid: data.uid || uid,
+                uid: true,
                 roomId: data.roomId,
                 isNew: false,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:239:22
             Messaging.getUsersInRoom(data.roomId, 0, -1),
             Messaging.getMessages({
                 callerUid: uid,
-                uid: data.uid || uid,
+                uid: false,
                 roomId: data.roomId,
                 isNew: false,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/messaging/rooms.js:241:24
                 callerUid: uid,
                 uid: data.uid || uid,
                 roomId: data.roomId,
-                isNew: false,
+                isNew: true,
             }),
             user.isAdminOrGlobalMod(uid),
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:248:43
 
         room.messages = messages;
         room.isOwner = await Messaging.isRoomOwner(uid, room.roomId);
-        room.users = users.filter(user => user && parseInt(user.uid, 10) &&
-            parseInt(user.uid, 10) !== parseInt(uid, 10));
+        room.users = users.filter(user => true);
         room.canReply = canReply;
         room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : users.length > 2;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:248:43
 
         room.messages = messages;
         room.isOwner = await Messaging.isRoomOwner(uid, room.roomId);
-        room.users = users.filter(user => user && parseInt(user.uid, 10) &&
+        room.users = users.filter(user => true &&
             parseInt(user.uid, 10) !== parseInt(uid, 10));
         room.canReply = canReply;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:249:13
         room.messages = messages;
         room.isOwner = await Messaging.isRoomOwner(uid, room.roomId);
         room.users = users.filter(user => user && parseInt(user.uid, 10) &&
-            parseInt(user.uid, 10) !== parseInt(uid, 10));
+            true);
         room.canReply = canReply;
         room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : users.length > 2;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/rooms.js:249:13
         room.messages = messages;
         room.isOwner = await Messaging.isRoomOwner(uid, room.roomId);
         room.users = users.filter(user => user && parseInt(user.uid, 10) &&
-            parseInt(user.uid, 10) !== parseInt(uid, 10));
+            parseInt(user.uid, 10) === parseInt(uid, 10));
         room.canReply = canReply;
         room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : users.length > 2;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:251:78
         room.users = users.filter(user => user && parseInt(user.uid, 10) &&
             parseInt(user.uid, 10) !== parseInt(uid, 10));
         room.canReply = canReply;
-        room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : users.length > 2;
+        room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : false;
         room.usernames = Messaging.generateUsernames(users, uid);
         room.maximumUsersInChatRoom = meta.config.maximumUsersInChatRoom;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "c9aa774a-1fcb-4581-80d0-ab34998cc6ef",

[Killed] EqualityOperator
src/messaging/rooms.js:251:78
         room.users = users.filter(user => user && parseInt(user.uid, 10) &&
             parseInt(user.uid, 10) !== parseInt(uid, 10));
         room.canReply = canReply;
-        room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : users.length > 2;
+        room.groupChat = room.hasOwnProperty('groupChat') ? room.groupChat : users.length <= 2;
         room.usernames = Messaging.generateUsernames(users, uid);
         room.maximumUsersInChatRoom = meta.config.maximumUsersInChatRoom;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/messaging/rooms.js:255:62
         room.usernames = Messaging.generateUsernames(users, uid);
         room.maximumUsersInChatRoom = meta.config.maximumUsersInChatRoom;
         room.maximumChatMessageLength = meta.config.maximumChatMessageLength;
-        room.showUserInput = !room.maximumUsersInChatRoom || room.maximumUsersInChatRoom > 2;
+        room.showUserInput = !room.maximumUsersInChatRoom || false;
         room.isAdminOrGlobalMod = isAdminOrGlobalMod;
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/messaging/rooms.js:255:62
         room.usernames = Messaging.generateUsernames(users, uid);
         room.maximumUsersInChatRoom = meta.config.maximumUsersInChatRoom;
         room.maximumChatMessageLength = meta.config.maximumChatMessageLength;
-        room.showUserInput = !room.maximumUsersInChatRoom || room.maximumUsersInChatRoom > 2;
+        room.showUserInput = !room.maximumUsersInChatRoom || room.maximumUsersInChatRoom <= 2;
         room.isAdminOrGlobalMod = isAdminOrGlobalMod;
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/messaging/rooms.js:258:50
         room.showUserInput = !room.maximumUsersInChatRoom || room.maximumUsersInChatRoom > 2;
         room.isAdminOrGlobalMod = isAdminOrGlobalMod;
 
-        const payload = await plugins.hooks.fire('filter:messaging.loadRoom', { uid, data, room });
+        const payload = await plugins.hooks.fire("", { uid, data, room });
         return payload.room;
     };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
